{"MPowered Entrepreneurship has allowed me to take risks, innovate, and lead others, and has surrounded me with some of the best people I have ever met. \n\nTogether, we have created initiatives that have engaged thousands of students and alumni and brought prominent startup companies and entrepreneurs to campus every year for the past decade. \n\nIf you believe in entrepreneurship education, please consider supporting us and the U-M Center for Entrepreneurship, who empowers us and other entrepreneurial organizations on campus to create our best work.\n\nDONATE HERE:\nMPowered:  http://bit.ly/2nff2af\nCenter For Entrepreneurship: http://myumi.ch/6pmAj": [0.699999988079071, 2.9000000953674316], "OS-Ew!": [-0.6000000238418579, 0.6000000238418579], "John O’Korn ruined my life.": [-0.5, 0.5], "Thank u.": [0.10000000149011612, 0.10000000149011612], "“Shabba” - @drew43545": [0.0, 0.0], "Proud to say I’m finally a grandpa. Roll Waterfall baby💦": [0.6000000238418579, 1.2000000476837158], "Ayee": [0.0, 0.0], "❤️": [0.30000001192092896, 0.30000001192092896], "MPowered X Keiana for the win! Stay obnoxious, my friends.": [-0.30000001192092896, 1.0], "Any other president would immediately address the death of four American soldiers, and this guy isn't even answering questions. Horrible.\n\n": [-0.8999999761581421, 1.7999999523162842], "If nothing has swayed you to consider the significance of your privilege, I hope this will.": [-0.4000000059604645, 0.4000000059604645], "“Two grande pumpkin spice lattes please”:": [0.30000001192092896, 0.30000001192092896], "At 6:15pm TODAY, the Entrepreneurs' Leadership Program will be holding its final Innovation Challenge! \n\nIf you didn't attend either the first two challenges, this is a great chance to meet ELP and inspire us with your work. \n\nAs a reminder, ELP offers two exclusive Entrepreneurship Bootcamp courses, all-expenses-paid trips to SF, NYC, DC, and more, and a guaranteed summer internship at a startup. What's not to like?\n\nSo come to TechArb (500 E. Washington St.) tonight to join the fun. We are all super excited to meet you.": [0.6000000238418579, 3.799999952316284], "Do you want a guaranteed internship at a hot startup? Exclusive courses dedicated to jumpstarting your entrepreneurial career? Free trips to Washington DC, New York, and San Francisco to meet founders, investors, and other industry leaders? \n\nIf these things sound exciting to you, join us at the Entrepreneurs' Leadership Program. A great first step would be attending our Innovation Challenge tonight from 7-9pm at the Union in the Pendleton Room. This event will allow you to meet current ELP students, explore Michigan's entrepreneurial ecosystem, and show your hustle. \n\nHope to see you all there!": [0.4000000059604645, 3.0999999046325684], "When we run into each other on ga〽️eday>": [0.10000000149011612, 0.10000000149011612], "Happy 17th birthday to the best little brother a big brother could imagine. 16 to 17 has really been an inflection point in your growth. You’re driving to school, throwing harder, and growing taller than I am, and I’m still taking it all in. Keep making us proud, brother. Can’t wait to see how high you can reach (literally and figuratively)  @ University of Michigan": [0.20000000298023224, 2.200000047683716], "Saying goodbye to this stud right here. Maybe we’ll be on the same flight to DTW for Welcome Week next year😏": [-0.20000000298023224, 1.0], "I’m actually the middle child #bigbrolos": [-0.20000000298023224, 0.20000000298023224], "These dudes rock": [0.20000000298023224, 0.20000000298023224], "https://medium.com/@AJEhrenberg/the-importance-of-alternative-perspectives-cac0f447737b\n\nListening is hard. Listening to things you don't agree with is even harder. But to have the dialogues that truly matter, we need to challenge ourselves to overcome this barrier.": [0.30000001192092896, 1.2999999523162842], "*taps microphone* “wake up everybody”": [-0.10000000149011612, 0.10000000149011612], "https://medium.com/@AJEhrenberg/be-direct-be-bold-daaca3a5e07c\n\nThere is WAY too much beating around the bush in our culture. Cut the shit and let your true feelings and intentions be known. Open, clear, and honest communication is the most effective way of getting your point across.": [-0.10000000149011612, 2.5], "Aye": [0.5, 0.5], "🐽": [0.10000000149011612, 0.10000000149011612], "Happy birthday to the most savage of shrimp to walk the earth. We in our 20’s brotha, let’s ride": [0.6000000238418579, 1.2000000476837158], "Since my trip to Cape Town in May, I have resolved to write more frequently. I love writing, sharing with others, and telling stories, but had never really maximized these passions. The philosophy of \"Diving In\" I learned and honed during my time in South Africa led me to the conclusion that I just had to take action and immerse myself in my writing. Throughout our lives, we will all take leaps of varying sizes. So I wanted to share some things I have learned that hopefully will give you all the confidence to take those risks and bet on yourself. \n\n": [0.5, 2.5], "Lmao. When the ‘leader of the free world’ is so incompetent he gets globally disrespected <<": [-0.4000000059604645, 1.0], "Wrote an article on growing up. Bet this will ring true for many of my late teens-early 20 somethings out there. Hope y'all enjoy!": [0.30000001192092896, 0.8999999761581421], "DOUBLE RAINBOW": [0.10000000149011612, 0.10000000149011612], "Optimal Shi stay dropping heeaat🔥": [0.800000011920929, 0.800000011920929], "Damn I miss Kill The Carrier Jayson Shrimp Jack Levine Ethan Ehrenberg": [0.0, 0.0], "Snap gang golf wang": [0.5, 0.5], "🙂😜🐠😬": [0.10000000149011612, 0.10000000149011612], "24 years of marriage, 20 years of fatherhood, infinite impact.\nThanks for being the person we all wish we were... hey, someone's gotta do it. \nCould not be more proud to be your son.": [0.10000000149011612, 0.800000011920929], "Congrats to Ethan Ehrenberg on an amazing season and the nice recognition!!": [0.8999999761581421, 0.8999999761581421], "They should just visit Obama's and take a pic w them": [0.0, 0.0], "http://www.mlive.com/news/detroit/index.ssf/2017/06/mass_detroit_immigration_sweep.html#incart_gallery\n\nImmigrate to the US when you're 3. Get caught for possession of Marijuana when you're 25 (a [controversial] crime many young adult Americans could be convicted of regularly). Live your life and raise your family for 3 ensuing decades. Get abruptly deported 20 years later when your half-wit president attempts to prove that he's all about 'Law and Order' by executing run of exchange deportations on innocent people. \n\nWhile there might be some murderers and rapists in that pile, those individuals still carried out their sentences like every other American... and got out justly.\n\nBefore destroying families by deporting their mothers, fathers, brothers, and sisters, maybe layer some intelligence on top of the decisioning... oh, wait, we fired the head of the FBI...": [-0.10000000149011612, 3.5], "Ya tu sabe": [0.4000000059604645, 0.4000000059604645], "Here's to 1.5 with the ride or die ❤️": [0.4000000059604645, 0.4000000059604645], "Missing every day being a wild, inspiring adventure.  #leadabroadlife": [0.30000001192092896, 0.6000000238418579], "From Floridian Club Cars to Dutch Ice Bars\nMy Girl > Yours": [0.699999988079071, 0.699999988079071], "\"Okay, for me, first of all, dopeness is what I like the most.\" - Kanye West": [0.0, 0.20000000298023224], "I guess I've been a little jumpy this week 👊🏼": [0.5, 0.5], "The real Elephant Walk #hazingawareness": [0.5, 0.5], "The fearless (and few) men of DIRECT Cape Town. Much love. #leadabroadlife": [0.4000000059604645, 1.2999999523162842], "When this little guy started beat boxing over the group singalong, I knew we were gonna be boys. #leadabroadlife": [0.0, 0.10000000149011612], "After years of attempting, I have finally summitted Mountain Dew #leadabroadlife": [0.30000001192092896, 0.30000001192092896], "Blue beard and the boys takin em by storm(ers) 🏉 #LeadAbroadLife": [0.20000000298023224, 0.20000000298023224], "https://www.thecollegefix.com/post/32596/\nThis is the kind of shit that let Trump win the election. \nPlease wake up, liberal America. We need to get our priorities straight. This cannot be what we stand for.\n...Also one of the most beautiful buildings on earth as it is, and I'd hate to see the 'snowflake' agenda make it its bitch.": [-0.10000000149011612, 0.8999999761581421], "Tongues out if you fly as fuuuck": [-0.4000000059604645, 0.4000000059604645], "This game literally had a front 9 and a back 9 😳": [-0.20000000298023224, 0.20000000298023224], "Ethan Ehrenberg my b": [0.10000000149011612, 0.10000000149011612], "Just a couple of Blue Devils 👆🏻": [0.10000000149011612, 0.10000000149011612], "Incredible": [0.699999988079071, 0.699999988079071], "My school sucks man": [-0.699999988079071, 0.699999988079071], "Against all odds, the Leemus has survived 20 years on his own existence. \n\nA year in review:\nYou left your room: 5 times\nL.O.P.S volunteer hours: 100\n\nJunior year shall be more lit than a Noah Syndergaard two seam": [0.0, 0.699999988079071], "HAHA what\n#vonvon": [0.20000000298023224, 0.20000000298023224], "LETS EAT": [0.20000000298023224, 0.20000000298023224], "Drizzy's hometown, KFC poulet, revolving restaurants in the sky, and exotic fish. Only in the 6️⃣": [0.20000000298023224, 1.0], "This kid gets it": [0.10000000149011612, 0.10000000149011612], "University of Michigan School of Information Class of 2019!": [0.0, 0.0], "ELP Inc. drafin' the s1 as we speak": [0.4000000059604645, 0.4000000059604645], "Me and my somewhat responsible counterpart": [0.6000000238418579, 0.6000000238418579], "Hello Michigan, how can we hELP you?〽️": [0.0, 0.0], "BYE LOUISVILLE": [0.0, 0.0], "One score and zero years ago, this ripe young piggy made her first mark on the world. I have only known you for about 1.5 of those years, but I can safely say that you have changed me for a lifetime. Can't wait to squeeze you! Much love ❤️": [0.30000001192092896, 2.799999952316284], "The WHOLE NCAA sleepin' on Papa DJ": [0.0, 0.0], "They didn't want us to be Big Ten Champs... so what we do?": [-0.5, 0.5], "I wrote something for a class about a month ago, and it inspired me so much, I decided to use it as my first Medium article! If you are interested in the social media debate and/or social activism, I definitely suggest you take a look. Hope people enjoy!": [0.6000000238418579, 1.899999976158142], "36 Hours.\nWhat will you build?\nMakeathon: Future City": [0.0, 0.20000000298023224], "Just a couple of domes #ripxandrew": [0.30000001192092896, 0.30000001192092896], "Got it from my Mama \n... but she was way cooler": [0.4000000059604645, 0.4000000059604645], "LOST ALL CONTACTS PLEASE TEXT ME WITH NAMES\n6463384639": [-0.30000001192092896, 0.30000001192092896], "lmao Lauren Roger": [0.0, 0.0], "Happy birthday to the most eccentric child I've ever met. You have seen my at my finest, my lowest, and my most domeless. The best is yet to come, and I can't wait to take on the world with you, homie.": [0.800000011920929, 2.5999999046325684], "What happens in Club Car stays in Club Car": [0.0, 0.0], "Feliz Cumpleaños C Lo!\nThanks for letting me press my face against yours at tailgates ❤️": [0.4000000059604645, 0.8999999761581421], "Winterfeast❄️🍗": [0.10000000149011612, 0.10000000149011612], "U of M's email server was hacked today, and anti-Semitic and racist messages flooded the inboxes of thousands of Michigan Computer Science students. \n\nThe message ends with a resounding \"Heil Trump\". And no, Trump's presidency has NO connection AT ALL with the insurrection of racial, religious, and ethnic discrimination. \n\nWe are seeing this happening in front of our eyes. This man, who we have elected to call the president of the wealthiest and most powerful country on earth, is galvanizing hatred in the US (and abroad). \n\nThis country has to get its shit straight.\n\n(Name is crossed out because they used the name of the student whose account was compromised)": [-0.4000000059604645, 3.299999952316284], "Friendliness: 100%": [0.10000000149011612, 0.10000000149011612], "That might have been the craziest play in football history": [0.30000001192092896, 0.30000001192092896], "The lopportunity of a lifetime": [0.10000000149011612, 0.10000000149011612], "Party was fun. Dessert table was better😬": [0.10000000149011612, 1.0], "https://www.impeachdonaldtrumpnow.org/": [0.0, 0.0], "Amazing": [0.800000011920929, 0.800000011920929], "https://www.crowdrise.com/delta-chis-marco-madness/fundraiser/andrewehrenberg1": [0.0, 0.0], "BOUT THAT TIME #marcostrong\n\nDonate here!: https://www.crowdrise.com/delta-chis-marco-madness/": [0.10000000149011612, 0.20000000298023224], "https://www.crowdrise.com/delta-chis-marco-madness/fundraiser/andrewehrenberg1\n\nHelp us support Marco and his continued fight against leukemia for the second straight year! Any amount helps <3": [0.4000000059604645, 1.2000000476837158], "Delta Chi Winter Rush\nJanuary 11th - Mass Meeting\nJanuary 12th - Open House\nJanuary 18th - Open House": [0.0, 0.0], "Spotlight's concert featuring ayokay, Quinn XCII, and Aash Mehta is right around the corner! January 19th is only two weeks away. Come to Necto to hear premier artists, bring your friends, and get a taste of what Spotlight has to offer. Check out this dope video that #theteam put together to get y'all hype! Absolutely worth the watch, and definitely worth getting your tickets as soon as you can! Hope to see all of you there. \n\nAs a reminder, get your tickets at: https://www.eventbrite.com/e/quinn-xcii-with-ayokay-presented-by-spotlight-tickets-29803552227": [0.4000000059604645, 3.200000047683716], "Bottling up 2016 with the legend of Palm Beach. May 2017 bring us more alcohol and less politics 🍾": [0.4000000059604645, 0.800000011920929], "Hit the jacuzzi with the guy who inspired your HS walkup song ✅": [0.30000001192092896, 0.30000001192092896], "Marco Madness is back. In one month and one day, Marco and the rest of Delta Chi will walk the tunnel at the Crisler Center, ready to fight cancer once again. While we congregate annually to have this battle, Marco does it every day and that is what makes it so special. This is not merely a fundraiser, but also a celebration of Marco and the obstacles he has continually overcome. Living two doors down from him this year has been an honor and a privilege. With a contagious passion for his brothers and life as a whole, having him back in the house has been the capstone of my Delta Chi experience this year. Fellow wolverines, family, and friends, I hope you can find it in your heart to contribute to our battle. Whether it's 5 dollars, 50 dollars, or 500, you are helping Marco, his family, the brothers of Delta Chi, and, most importantly, all many children who fight pediatric cancer. \nExpect many more posts like this over the course of the month. \nWe at Delta Chi wish you the happiest of holidays and new years, and hope that you can fit Marco Madness into your 2017 plans.": [0.30000001192092896, 3.799999952316284], "A very Swagler Christmas": [0.20000000298023224, 0.20000000298023224], "Ugh I'm gonna miss them": [-0.5, 0.5], "A Schwabelberg Christmas Story🌲": [0.30000001192092896, 0.30000001192092896], "Egregious.\n": [0.10000000149011612, 0.10000000149011612], "Who knew paradise could be -5 degrees? 🏔⛷": [0.0, 0.10000000149011612], "Me and Pikajew wishing you the happiest of holidays! (no hate pls)": [0.20000000298023224, 1.2000000476837158], "RIP": [-0.4000000059604645, 0.4000000059604645], "LREI making a difference in the streets, Zay and Poly making a difference on the field. NYC making a difference always. \nEhrenbergs stay picking the winners out here 😏\nVery proud.": [0.4000000059604645, 1.2999999523162842], "Happy birthday, stud.\nThanks for being everyone's Papa Bear.\nFrom talking football to talking venture, I can't wait for the time we have ahead of us.\nThankful to call you my father, my mentor, and my friend. Have the best day, and hype to celebrate next week.❤️": [0.6000000238418579, 3.299999952316284], "GO Paul Dougherty GO MPOWERED GO HAN GO ENTR GO BLUE": [0.20000000298023224, 0.20000000298023224], "Thanks for 365 days of unforgettable moments (except for in this pic maybe), laughs, stories, and friendship. You are my best friend, my ~partner in crime~, and my ~rock~. So grateful to spend the day with you💕": [0.8999999761581421, 2.700000047683716], "OSU Refs are more domeless than its students": [0.0, 0.0], "When lil bruh is taller than you 😳": [0.4000000059604645, 0.4000000059604645], "I will not salute Ohio State. They did not deserve to win. The officiating crew should be ashamed of themselves, and I hope they look back and realize they negative impact they have had on the sport of football. \n\nI am so proud of this Michigan team. Sure, we had some missed opportunities today, but I have never seen a team be transformed by a coach like Michigan under Jim Harbaugh's control. He has brought back the Michigan football that had been known and loved for generations, and the love and respect he has received reflects that. \n\nI am proud to be a Michigan Wolverine, and wish the worst for The Ohio State and all of its constituents. \n(If you couldn't tell I'm pretty upset)": [-0.10000000149011612, 4.099999904632568], "🐎🐎🐎": [0.4000000059604645, 0.4000000059604645], "ADULT KIDS...How well do you know your MOM?\n*****Tag Mom to grade your answers*****\n\n1. She is sitting in front of the TV, what is she watching? \nSaturday Night Live\n\n2. Usually what dressing does she eat on salad? \nBalsamic or Caesar \n\n3. Name a food she hates? \nAll seafood\n\n4. You go out to eat, what drink would she order?\nWater, Diet Coke, Margarita (if we tryna get lit) \n\n5. Favorite music to listen to?\nJackson Browne\nRolling Stones\n\n6. What is her nickname for you?\nHoney, baby, sweetie, and any other possible motherese pet name\n\n7. What is something she collects? \nGVLL Clothing 😂\n\n8. What would she eat every day if she could?\nMac n' Cheese\n\n9. What is her favorite cereal?\nApple Jacks\n\n10. What would she never wear?\nAn LV bag\n\n11. What is her favorite sport? \nBaseball\n\n12. What is something that you do that she wishes you wouldn't do?\nMiss my flight home for Thanksgiving 😬\n\n13. You bake her a cake for her birthday, what kind is it? \nTrick question. Apple Pie.\n \n\n14. Favorite animal?\nDog\n\n15. If she could spend all day doing anything, what would it be?\nReading on the beach": [0.10000000149011612, 9.399999618530273], "Came for the tailgate, caught a shrimp \nTill next year, BStone": [0.10000000149011612, 0.10000000149011612], "Go fam. Go entrepreneurship. Go blue!": [0.20000000298023224, 0.699999988079071], "Team Zuckerberg?": [-0.10000000149011612, 0.10000000149011612], "Still undefeated in our hearts": [0.30000001192092896, 0.30000001192092896], "WTF NOVEMBER": [-0.10000000149011612, 0.10000000149011612], "Where is Trump's statement condemning the latest racist/anti-Semitic uprisings? Lmk": [0.0, 0.10000000149011612], "There were enough Harambe votes in Cincinnati to flip the election. #DammitHarambe\n": [0.0, 0.0], "Did that REALLY just happen?": [-0.30000001192092896, 0.30000001192092896], "Champs>Your liquor store #IStandWithIsrael": [0.0, 0.0], "VOTE": [0.0, 0.0], "〽️ake America Tailgreat Again": [0.0, 0.0], "The team the team the team": [0.10000000149011612, 0.10000000149011612], "Happy Birthday to the #1 Mom. Thanks for picking up my calls at 3:30am, always giving me spot-on advice, and making me feel loved 24/7. Love you❤️": [0.800000011920929, 2.5], "Bring it back baby": [-0.20000000298023224, 0.20000000298023224], "I miss Trick or Treating": [0.10000000149011612, 0.10000000149011612], "I'm a pretty princess.": [0.30000001192092896, 0.30000001192092896], "Good Morning Michigan\nCatch us every Sunday 12/1 Eastern": [0.5, 0.5], "Hype": [0.10000000149011612, 0.10000000149011612], "Quality squad David Roger Lauren Ethan": [0.0, 0.0], "Join MPowered Entrepreneurship, the University of Michigan Center for Entrepreneurship, Ann Arbor SPARK, TechArb and the rest of the Michigan entrepreneurship community as we host the first IgniteIt Meetup at 7PM at the Innovatrium. https://www.facebook.com/events/316958245336669": [0.10000000149011612, 0.20000000298023224], "New House New Me The Sequel": [0.800000011920929, 0.800000011920929], "Come to the Diag between 10 and 3 today to get a good taste of UMich Entrepreneurship!": [0.5, 0.5], "Adonai wouldn't say no to buffalo chicken Mac n' Cheese #HeProbablyWould #Oops": [-0.6000000238418579, 0.6000000238418579], "Come to the Diag on Oct 13th to see all the Michigan Entrepreneurial community has to offer. Hosted by MPowered and CFE, supported by Tech Arb, Innovate Blue, and LSA Student Government. Over 30 Orgs dedicated to creating the innovators of tomorrow will be there. The only questions is will you?": [0.20000000298023224, 0.8999999761581421], "Yvng cousins out here (OFFICIALLY)\nCongrats to Jodie and Luis!❤️": [0.5, 0.5], "Respect": [0.10000000149011612, 0.10000000149011612], "Back for a h🍎t sec": [0.0, 0.0], "Come to the Diag on October 13th to see some of the exciting entrepreneurship opportunities Michigan has to offer. Share this to start the fire #LightItUp": [0.4000000059604645, 0.800000011920929], "2 Bergs 2 Schwabes and a Toe walk into a tailgate": [0.0, 0.0], "We got the keys": [0.10000000149011612, 0.10000000149011612], "Just your average play from the MPowered playbook": [0.0, 0.0], "lolol": [0.30000001192092896, 0.30000001192092896], "1800-BOOTLESS #freepaige": [0.0, 0.0], "Bolder than Boulder〽️": [0.10000000149011612, 0.10000000149011612], "Thanks for the share The Michigan Daily": [0.0, 0.0], "It's crazy to think that this is my second 9/11 away from the NYC community. It's even crazier to think that it has been 15 years since that tragic and surreal day. New Yorkers around my age share a lot of the memories I have; brief, naive observations of the TV and, perhaps, a view of the WTC itself, parents and other relatives crying and looking fearful, fathers and mothers rushing home to their families, and parents shielding our eyes from the harsh and hateful reality. Along with most New Yorkers, I know (way too) many people that lost someone 15 years ago. To those people: I love you all. Be strong. You are all warriors.\nThere is no community that I am more proud of than the one I have in NYC. There is no community that I know that is more resilient. In spite of all responsibilities and self-interest, we are of city of one on  9/11. We are a diverse, unique, and brilliant 8 million person family, and no amount of hatred or fear can change that. \nNever forget.": [0.10000000149011612, 4.699999809265137], "Happy 16th (not so) little man. \nThanks for being the dopest of brothers and the best friend I could ask for.\nYou're gonna kill junior year and we're gonna kill it in Ann Arbor when you come visit 😉\nMuch love lil bro❤️": [0.699999988079071, 2.200000047683716], "Ho〽️ies": [0.10000000149011612, 0.10000000149011612], "Wow": [0.20000000298023224, 0.20000000298023224], "Thank you Luis LoudMouth Camacho for the nomination.\nI know this is just the next social media fad, but given the cause I had to oblige.\n22 veterans commit suicide every day. That is a staggering statistic. \nWhile we claim to support our troops, there needs to be more attention paid to our vets, who may well come out physically, mentally, and emotionally scarred. That sacrifice is often made without ample attention or treatment. \nI nominate David Silverman Ethan Ehrenberg and Tyler Wincig to take the challenge and share what our troops mean to them.\nI also highly encourage anyone to donate 22 dollars to the veteran specific charity of their choice. 🇺🇸🇺🇸🇺🇸": [0.10000000149011612, 2.4000000953674316], "New house new me": [0.4000000059604645, 0.4000000059604645], "http://www.businessinsider.com/donald-trumps-ex-wife-once-said-he-kept-a-book-of-hitlers-speeches-by-his-bed-2015-8\n\nDisturbing...": [-0.30000001192092896, 0.8999999761581421], "Them boys up to somthin...": [0.0, 0.0], "http://www.rawstory.com/2016/07/dnc-sends-trump-into-toddler-rage-i-wanted-to-hit-a-couple-of-those-speakers-so-hard/\n\nHe is talking about hitting his opponents now? \nWell I've never heard that one before...": [0.0, 0.20000000298023224], "http://www.haaretz.com/world-news/u-s-election-2016/1.733564\n\nWhen the 'Bernie or Bust' people are 'pro-equality', but fail to realize that they are inciting antisemitism. And y'all call yourselves 'woke'. \n*Sips Manischewitz*": [0.0, 0.30000001192092896], "Barack Obama has been an incredible president.": [0.699999988079071, 0.699999988079071], "This really might be the most egregious speech in American history.": [-0.8999999761581421, 0.8999999761581421], "\"We the People of the United States, in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defense, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America\" #FamousMelaniaTrumpQuotes": [0.800000011920929, 0.800000011920929], "This is what a properly trained police officer looks like. All these shoot-first officers need to take notes or turn in their badges. \nNot only is there systematic racism within American police forces, but there is also a lack of accountability. Why can't the good cops (the majority) just admit that the bad cops fucked up?\nThe people who insinuate that all cops are bad are wrong, but most cops need to swallow there pride and break down the institutionalized 'blue wall' that is so corrupt to the core. \nIt was a problem decades ago and it is a problem now. \nThis is something I hope that 'Black Lives Matter', 'Support the Police', and everyone in between can get behind.": [-0.30000001192092896, 3.4000000953674316], "🐉~Beach Day~🐷": [0.4000000059604645, 0.4000000059604645], "Offended": [0.0, 0.0], "💜": [0.20000000298023224, 0.20000000298023224], "https://www.facebook.com/archdukedostuff/videos/1316448935049630/?pnref=story\n\nThis kid is impressive\nHe's like the polysci version of sports science": [0.4000000059604645, 0.8999999761581421], "Today I rocked a Walmart original and taught @ethanehrenberg what a PBR was. \nGod bless. 🇺🇸": [0.4000000059604645, 1.2000000476837158], "Squad up": [0.10000000149011612, 0.10000000149011612], "Maybe the worst Freudian slip in political history?\nElie Wiesel knows he's in a better place. A place without orange dudes for sure.\nRIP ❤️🔯": [0.0, 1.399999976158142], "Hbd2me": [0.0, 0.0], "Tyronn Lue lowkey just gets paid to sit courtside": [0.0, 0.0], "Long live the 3 Amigos🤘🏼\nHappy Dad Day to the the biggest savage I know. Can't wait for the many hot tub seshes, runs, sushis, and scotches in our future❤️": [0.800000011920929, 1.7000000476837158], "Daily thoughts be like:": [0.20000000298023224, 0.20000000298023224], "Mr. Burns said it beautifully. Please don't vote for him.": [0.4000000059604645, 0.800000011920929], "Everybody in this picture is related to me": [0.30000001192092896, 0.30000001192092896], "This is actually a biased piece. Google does the same thing for the other two candidates. Google avoids terms like 'criminal' or, in the case of Bernie Sanders, 'violation' in SEC violation or 'illegitimate' in illegitimate child. Look at it for yourself if you'd like. This article claims to be reporting the facts, but it is yet another poorly supported attack against Hillary. \nWe don't want Trump in office. I wish Bernie supporters would stop going out of their way to attack Hillary. Bernie lost. I'm not gonna argue about Bernie anymore, because he's now irrelevant to the race, regardless of my position on him. I just don't think Bernie Supporters, who are mostly the epitome of anti-Trump, want to do things that, in effect, promote Trump's campaign. \nThis article is a walking media bias trying to make an attack on media biases. Funny, SourceFed!": [-0.20000000298023224, 4.699999809265137], "🤔🤔🤔": [0.0, 0.0], "A salamander, a pig, and Toe": [0.0, 0.0], "Running through the 6️⃣(th) with my woe :P": [0.6000000238418579, 0.6000000238418579], "Mood:": [0.20000000298023224, 0.20000000298023224], "Warriors in 4. Westbrooks a flop. KDs a flop. LeBrons a flop.": [0.0, 0.20000000298023224], "Yesterday, @asofnowyes showed @a_agler48 what real music was. \n~Happy Memorial Weekend 🇺🇸~": [0.4000000059604645, 0.800000011920929], "18 Years later and Grammy still knows what's good 🐻": [0.8999999761581421, 0.8999999761581421], "Great to be back👨‍👩‍👦‍👦": [0.8999999761581421, 0.8999999761581421], "We may not play on the best teams in the world, but we sure know how to hype up a dugout ⚾️🇺🇸": [0.20000000298023224, 0.20000000298023224], "Happy Birthday, Dyl! From our marriage, to squad bubble baths, to New Years underwear dancing in Tolland, (none in the past decade, don't worry, instafam) it's been real having you as a day one homie. Excited for Bubby's later🙌🏻": [0.699999988079071, 2.200000047683716], "Just your average colon p and fishy lookin' fly 😎": [0.10000000149011612, 0.10000000149011612], "As philanthropy chair of a fraternity that raised almost $50,000 last year for cancer research and autism awareness, I can't help but challenge the premise of this policy, which is essentially discouraging leadership in areas that Harvard feels isolates the privileged and excludes the less fortunate. Not only does Harvard's elitist history lead to a contradiction, but they are also neglecting the governing values of many fraternities on their campus and throughout the nation. If one looks past the stigmatized notion of social stratification, they will often find a deep background in community engagement and public service. Same sex organizations will exist. Same sex sports will be played. That is the purpose of an affinity group: to be a part of a group of like-minded individuals with similar goals and ideas (This doesn't mean fraternities members are the SAME. Everyone has a story). There is no end all be all way to define diversity, and writing these social constructs off as exclusive and discriminatory doesn't account for all of the great things that happen within them. Keeping an open mind goes both ways. Leaders within the the Harvard Greek community will be hindered by these policies. The perceived 'top' is being pushed down, when many of its members are seeking to make a positive difference and to give back. \n": [-0.20000000298023224, 4.400000095367432], "Arguably the most electrifying individual and team season of all time across all sports. Curry is labeled as a 3 point shooter, but more than half of these plays exhibit ball handling, close range finishing, and passing unlike anything I've ever seen. He isn't real. He just isn't real.": [0.10000000149011612, 1.100000023841858], "Legend": [0.10000000149011612, 0.10000000149011612], "Happy Mommy Day to the only person who takes my 3:30 am calls during finals week. Thanks for being the most smart, loving, caring, creative, and beautiful mommy out there! ❤️": [0.4000000059604645, 1.399999976158142], "Meet my baby cousin, Spencer.\nWe have a young Koufax in our midst. 👶🏼⚾️": [0.20000000298023224, 0.699999988079071], "The team. The team. The team. ITB\nSee you soon Marco": [0.10000000149011612, 0.4000000059604645], "Half the squad was sick, still rallied like MJ. 🏀\nThanks for coming out! 〽️〽️\n#marcostrong": [0.0, 1.2000000476837158], "Despite  setbacks and conflicts, we are proud to say we have hit the 15k milestone! As happy and proud as we are, we are gonna keep pushing forward for our homie Marco. Every dollar more is another step towards finding a cure. A big thanks to all those who have given their generous contributions to our efforts, and we will continue to encourage others to do the same. #marcostrong": [0.5, 2.700000047683716], "Kobe": [0.0, 0.0], "Help this stud out as he continues his valiant battle against Leukemia. Pull for my boy Marco Gutierrez so he can continue to pull like he is in this pic.  DONATE HERE!!: https://www.crowdrise.com/delta-chi-/fundraiser/andrewehrenberg1": [0.20000000298023224, 0.6000000238418579], "Help my boy Marco strike out cancer (and Bryce Harper) by supporting Delta Chi and Theta Chi's 5-on-5 basketball tournament in his honor! All the money goes to Leukemia research at the National Children's Hospital in Washington, DC. \nLIKE THIS STATUS AND I'LL SEND YOU A $3 VENMO REQUEST. \nInstead of getting fries with your burger tonight, like this status and help save lives :) \nOR  you can donate to our fundraising page here:\nhttps://www.crowdrise.com/delta-chi-/fundraiser/andrewehrenberg1": [0.30000001192092896, 1.899999976158142], "I respect the shit out of Bernie for this.\nI thought better of CNN smh, this is embarrassing.": [-0.5, 1.100000023841858], "Happy National Sibling Day to the best friend could have ever asked for (even though I kinda had no choice)\nSee you soon, kid❤️👬": [0.699999988079071, 0.699999988079071], "\"Shh\"": [0.10000000149011612, 0.10000000149011612], "This is a squad": [0.0, 0.0], "While I have my issues with Hillary, this is the problem the media's influence on modern politics. While my friends post this all over Facebook thinking that it is \"funny\" or \"appalling\", all I can think about is how much doing that exacerbates the personalization bias in the media. Who cares if she takes the subway? If you were the secretary of state and worth millions of dollars, you might not take the subway either. This is a classic example of how the Sanders team and my generation frame Hillary as elitist, inadequately fluent in pop culture, and ingenuine. While this video is funny on the surface, it really isn't, because hitting share and tagging all of your friends is worsening the already existing problems with the media. This stoops just as low as Trump does, because it takes advantage of the malleable positions of moderately politically educated millenials like myself. I've definitely fallen victim to the influence of silly stuff like this, but I just know this one is bullshit.": [-0.4000000059604645, 3.9000000953674316], "One of country's earliest pioneers left us today. Rest easy, Hag \nhttps://www.google.com/amp/s/www.yahoo.com/amphtml/music/merle-haggard-country-music-legend-dies-79-174340002.html?client=safari#": [0.6000000238418579, 1.2000000476837158], "My #1 drinking partner": [0.30000001192092896, 0.30000001192092896], "When the squad was still vertical 😵": [-0.10000000149011612, 0.10000000149011612], "https://www.youtube.com/watch?v=9VoNgLnjzVg": [0.0, 0.0], "DONATE HERE: https://www.crowdrise.com/delta-chi-/fundraiser/andrewehrenberg1\nHi, Everyone! As co-philanthropy chair of Delta Chi along with my good friend Justin Kaplan, we are EXTREMELY excited to finally announce our upcoming event to support another good friend of ours, Marco Gutierrez in his battle against leukemia. We've worked extremely hard to make this as dope as possible. Looking forward to everybody enjoying the madness, supporting Marco, and ballin out #marcostrong\nHere some info about the event:\nMarco Madness is raising money for treating pediatric leukemia through the Children’s National Medical Center in Washington D.C. Children’s National is currently the only health system designed for kids in the Washington D.C. metropolitan area.With your help, and donations, we can help fund the fight against pediatric leukemia. This philanthropy event honors Marco Gutierrez, a freshmen at the University of Michigan, who was forced to leave school shortly after arriving due to the remission of his Acute Lymphoblastic Leukemia. Marco courageously fought through treatment of A.L.L. for three years of his life in high school prior to coming to Michigan. He currently is at home fighting hard to recover so that he can return to Michigan in the fall. Marco is a loving, caring, courageous, and truly inspirational friend and individual. We want to support Marco to beat his leukemia like the first time, as well as support everyone else who suffers from these horrible diseases.": [0.30000001192092896, 5.0], "Love it": [0.8999999761581421, 0.8999999761581421], "My squad>": [0.10000000149011612, 0.10000000149011612], "Didn't know what Roger Ehrenberg and Carin Levine Ehrenberg meant until the past semester and a half. Thanks for 18 years of propaganda": [-0.10000000149011612, 0.8999999761581421], "\"Wait, which university do you attend again?\"": [0.0, 0.0], "Eyes, eyes, baby 👀❄️": [0.4000000059604645, 0.4000000059604645], "Sachettiiii": [0.0, 0.0], "Wanted better street cred\nI think I failed miserably": [-0.800000011920929, 0.800000011920929], "These are pretty lit": [0.5, 0.5], "Proud to be a part of it 🍎": [0.8999999761581421, 0.8999999761581421], "🐾paws on, paws off 🐾": [0.10000000149011612, 0.10000000149011612], "Views from the temp🔑": [0.4000000059604645, 0.4000000059604645], "Miss my little homie 👬": [0.30000001192092896, 0.30000001192092896], "Whatchu lookin at, Willis?": [0.0, 0.0], "Fam is back in town😍\n#rushzingermans": [0.6000000238418579, 0.6000000238418579], "https://soundcloud.com/dudemadison/sunday-baby-feat-aaron-weinstein\n\nNew firee single from my boy Leo Gitelman. Check it out!!!": [0.10000000149011612, 0.30000001192092896], "http://michigan.247sports.com/Bolt/Watch-Lil-Waynes-extremely-excited-about-Michigan-43448519\n\nWhen our future president says GO BLUE": [0.0, 0.10000000149011612], "Shanahan said he's taking his talents to Delta Chi. Coming to an elevated surface near you this fall. #signingszn 🏈": [0.10000000149011612, 0.5], "The girlfriends🔑": [0.4000000059604645, 0.4000000059604645], "Lauren Schwabe Ew": [-0.20000000298023224, 0.20000000298023224], "¡Feliz cumpleaños mi querida!🎉\nI'm glad we got so close this year, and am thankful to have you as one of my most loyal and best friends. Whether it's fending off crack dealers from Union Square or beating up blow up toys in front of Greenwich Village lingerie stores, we always know how to keep it interesting. I got a really big team, and you are definitely one of its star players. You gotta come visit Michigan so we can take our antics to a whole new level. Much love and hope you have an amazing birthday. See you in March❤️": [0.6000000238418579, 3.700000047683716], "Call me Uncle Drew": [0.0, 0.0], "Happy 19th to my best friend (and his annoying twin sister). The past year has been one of major changes. Beginning as second semester seniors and Citi Bike rides from Manhattan to Brooklyn, and ending here, at separate universities where we have both changed a lot, but remain as close as ever. There is nobody I'd rather sesh behind movie theaters with, chill in the locker room during free periods with (@t_wincig19 too), and talk for hours about anything that is on my mind with. I trust you more than almost anyone else, and you have basically become a part of the Ehrenberg family. So many good times to come, brother.\nAva: so glad we got close this past year❤️. As much as we both bother Armon (and each other), I have enjoyed being an honorary Mozaffari sibling. \nLove you both❤️": [0.4000000059604645, 4.5], "Meet the Newly Initiated Brothers of Delta Chi. Boys, we finally made it. Looking forward to an absurd 3.5 years ahead. #itb": [0.30000001192092896, 1.399999976158142], "Go Blue!": [0.10000000149011612, 0.10000000149011612], "Hi from mama and me": [0.20000000298023224, 0.20000000298023224], "Me and mine vs you and yours. \nJust give up while you still can😎": [0.4000000059604645, 0.800000011920929], "The boys take to the hills 🗻": [0.20000000298023224, 0.20000000298023224], "Fam bam gram 🏝": [0.4000000059604645, 0.4000000059604645], "Golf game like Jordan": [0.4000000059604645, 0.4000000059604645], "Room views ☀️🏝#blessup": [0.4000000059604645, 0.4000000059604645], "We're easily the two craziest girls in Pi Phi\nSee you in a couple weeks, babe😘": [0.5, 0.5], "Dope.": [0.6000000238418579, 0.6000000238418579], "Fighting the flu with Photoshop (in case you couldn't tell)\nHappy Hanukkah/Christian Hanukkah from my family to yours <3": [0.8999999761581421, 0.8999999761581421], "accurate?": [0.20000000298023224, 0.20000000298023224], "http://brobible.com/life/article/wounded-soldier-posts-message-about-muslims/\n\nJust something to think about... Whether you're right, left, somewhere in between, or don't really care, one of our boys in uniform has spoken. As someone with very close Muslim friends, I agree with Chris... Fuck off. Pretty sick of this whole Trump spectacle.": [0.0, 1.7999999523162842], "1 more hour! Get the good stuff while it lasts and support a great cause!!!": [0.5, 1.0], "About 18 and a half years ago, I was put into this world the two most influential caregivers, mentors and friends: my parents. My dad and I have a relationship that I cherish like no other. He has been not only my father, but also my baseball road trip companion, coach, best friend, workout buddy, drinking buddy, the only guy who will outdo me on a Bar Mitzvah or Wedding dance floor, tutor, advisor, and this is naming a few (fine, slightly more than a few). As my man Rog turns 50, he has never been younger. He is in the best shape of his life with the best job he has ever had and his kids are doing pretty well too 😏. He is a loving and thoughtful husband as well. He won't go a day without letting my mom know that he's the luckiest man on the planet. You are still in your prime, Papa Bear. Can't wait for Mexico. Happy f'n birthday! ❤️\nPS Had to steal MG's pic for the gram because it's just too fresh. (And Dave made the cut because he's the homie)": [0.4000000059604645, 6.199999809265137], "I'll be over there. Come over when you're ready.": [0.0, 0.0], "Lil' drunk on you🍻": [-0.20000000298023224, 0.20000000298023224], "Happy 18th to one of my oldest and greatest friends. I'm so glad I punched you in the face while we were playing magic scarves in the 3s, because it was the beginning of a historic friendship. From making associations in 2k, to brainstorming film ideas, to smoking Black n' Milds at 3am on my street corner (@a few days ago), we've had some pretty crazy times. Nobody can make me laugh or drive me insane like you. Love you like a brother. You're finally 18. So much greatness is in store for you , young one.❤️": [0.5, 4.800000190734863], "No worries. I figured it out. \nGo Blue, baby.": [0.30000001192092896, 0.8999999761581421], "I don't know how to set a temporary profile picture. \n#BeatOhio": [-0.10000000149011612, 0.4000000059604645], "Reuniting with my little ones in 5 days! 🙌🏻": [0.20000000298023224, 0.4000000059604645], "Support a great cause, have some delicious baked goods, and get free clothes. How could you go wrong?": [0.20000000298023224, 1.2999999523162842], "Because we are such sensational people": [0.6000000238418579, 0.6000000238418579], "Earlier this week, my good friend, and future fraternity brother, Marco, revealed to our entire pledge class that he had struggled with Leukemia throughout high school. He fought like no other, and got into, in my opinion, the best school on the planet. Without even knowing him for that long, I can honestly say that he is one of the toughest kids I know. Yesterday we found out that the cancer came back, and that he has to return home to receive treatment. No kid, let alone a great kid like Marco, should have to go through that.  \nWe know he will beat it, and he knows he will beat it, but we still really need your help. \nFriends, family, and fellow Michigan students, I ask that you take a moment (and maybe a few dollars), and invest some effort in making a difference. Help Marco, and millions of others suffering from cancer, by showing your support. Anything would be greatly appreciated. \nGet well soon, Brother Gutierrez. Beat the shit out of cancer just like you did last time.  \n": [0.20000000298023224, 3.5999999046325684], "They had to carry me out. \n#amateurhour": [0.0, 0.20000000298023224], "Happy birthday to my fun, caring, thoughtful, beautiful and brilliant mommy. Can't wait to see you tomorrow!❤️": [0.800000011920929, 1.600000023841858], "Everybody go to RiseToWin.org and take the pledge! Whether you are an athlete, a fan, or neither, this is a great way to show your support for racial equality in sports. Guys like Branch Rickey and Jackie Robinson have utilized sports to advocate for civil rights by striving for a common goal of competition and sportsmanship. We should continue the tradition of great men like them by supporting Stephen M.   Ross' initiative to affect change in the sports realm and beyond. #risetowin #msbc15": [0.4000000059604645, 2.0], "Mich Round 2": [0.0, 0.0], "They still think I pissed in the water bottle\n#beatstate #theboyswiththegeese": [-0.6000000238418579, 0.6000000238418579], "My favorite guys right here": [0.8999999761581421, 0.8999999761581421], "I guess I can't complain. College Gameday next week. Get ready. \n#ThisIsMichigan #BeatMSU": [0.20000000298023224, 1.100000023841858], "Looking forward to getting involved!": [0.699999988079071, 0.699999988079071], "See you in two weeks fam": [0.20000000298023224, 0.20000000298023224], "Never seen such bullshit in my life": [-0.699999988079071, 0.699999988079071], "80 years apart, same UMich Law Quad. \nJust tryin' to make Great Grandpa Herbie proud.\n#ho〽️e": [0.30000001192092896, 1.100000023841858], "RIP Yogi Berra. He was one of the truest and strongest Yankee leaders of all time. Beloved by all fans and active with the team till his last breath. I remember being at Spring Training down in Florida, and being shocked to see Yogi behind the plate watching batting practice. He was really a good dude: a phenomenal catcher, a philanthropist, and a good man. Yankee nation and baseball as a whole will dearly miss you. And for my fellow Jews (and everybody else), on this Day of Atonement, Yogi can teach us a lot (as the most quotable baseball player out there): \"If there's a fork in the road, take it.\"": [0.20000000298023224, 2.5999999046325684], "Happy 18th to my little cuz and one of my best friends. I'm so glad we got to have a week between Bethesda and NYC this summer. We bowled, we drove, we ate, we attended @itsdorahk 's photoshoot and much more. We always manage to make the most of our time together, and there's never a dull moment. I can't what to see what college decision you make and where that will take you. You're the best, man. So excited to see you and fam in Virginia. Maybe Swagler and The Dude can make an appearance on a Richmond, VA bowling alley😜\nLove you, brother❤️ talk soon": [0.6000000238418579, 5.900000095367432], "Boys who obliterate geese together stay together": [0.20000000298023224, 0.20000000298023224], "Mich week 1": [0.0, 0.0], "For the first time since I left, it feels truly strange to be away from home. This will be the first time in my life that I'm not there to honor this day with my New York City community. On this day, 14 years ago, our community came together under a tragic and shocking circumstance. While people could've ran from the burning building, pushing their peers out of the way, many actually stayed to help rescue their fellow New Yorkers and many of them lost their lives. To the heroes of that day and of the days following, your unwarranted sacrifices, often for complete strangers, are impossible to repay. From the aforementioned brave coworkers to the firemen and volunteers who lifted our broken community to the memorial committee who created a structure of universally patriotic significance. So much has been done in lieu of 9/11, and I have grown up witnessing the process. So it's really weird to not be there right now: walking to the bus with my brother and going to the Poly memorial garden in silence. I am there in spirit🇺🇸": [-0.10000000149011612, 3.200000047683716], "Dagin with my ladies☀️. #ultra16 #orientationsquadliveson": [0.0, 0.10000000149011612], "E,\nHappy 15th! I’m so proud of you and how much you’ve grown up this year. I’m so excited for the next four years of our brotherhood. From visiting me in Ann Arbor, to time back in the city, the memories we will make will be endless. I already expended too many of my tears on my first card, so I will just leave it at this: keep working hard, enjoy sophomore year, and always keep in touch. #365": [0.5, 3.0], "7 and a half hours in. Gotta show those Ohio people their western superiors. #classicgoblueroadtrips": [0.0, 0.10000000149011612], "To all who know this about me (and to those who don't), I am saying goodbye to a significant part of my life today. Tomorrow, not only do I leave home behind, but also an addiction. To all my friends and peers reading this (or skimming), please understand that this is what I have to do. I have to make a promise to myself and those around me that I am making a change. To those of you who chew tobacco or have family or friends who do, this is for you. About a year and a half ago, I tried Skoal wintergreen smokeless tobacco pouches. Chewing tobacco (or dip) culture in baseball declined a few decades ago, only to surge back into popularity over the past 15 years. The highest levels of the game have made significant effort to limit the use of chew or dip and to educate about the adverse effects and promote alternatives such as gum, sunflower seeds and herbal snuff. After all of these endeavors, dip is still at large in the game of baseball and throughout other sports such as football and hockey. For me, I was hooked right away. I started dipping 3, 4, and sometimes five times a day. I remember days down south at baseball tournaments where I did it so much I couldn't keep track. It was mindless. To all the smokers and dippers out there, think about how many times nicotine has hypnotized you into feeding the addiction. I am someone who likes to feel in control, but I uncharacteristically let myself lose control multiple times a day. When my parents found out last summer, it was a mess. I had never seen my dad truly ashamed in me until that day. I told them that I was addicted and promised to stop. That didn't go well. After a month of abstaining, I relapsed. I continued to use covertly for several months. Without any of my family knowing, there was very little guilt, so it made it easier for me to make bad decisions. These scenarios continued over the following year. I've never seen so many concerned family members and friends, and I've never seen my mother cry as much as she did. I didn't really understand why until today as I sat in an oral surgeon's office. He told me I'm probably fine, but that I have a small white patch on the inside of my gum called leukoplakia. Most dippers develop these, but some can be pre-cancerous or cancerous. As soon as I heard that, I said \"I'm done\". That was it. Months of therapy, tears and begging. All it took was some cold hard facts, and the knowledge that a pointless habit has left a potentially lethal mark on me. I love baseball. I love country music. I love Diet Mountain Dew. I really loved dip. Despite my urban upbringing, baseball turns me into quite the hick. While all those other hobbies are fun, dip is certainly not worth it. I do not intend to get buried by my parents and brother for something so trivial and pointless. Fuck that. I intend to live a long life. I am leaving for one of the best universities in the world tomorrow morning, and I don't want to worry about getting mouth cancer while I'm at it. So parents, don't just discourage smoking, make sure to do the same for smokeless (especially for those of you with young boys). I have not and will never pick up a cigarette (my grandmother smoked 2 packs a day for 55 years, and I begged her to stop until she did), but I somehow thought chewing carcinogens was cool. God knows where I got that logic, but I'm glad I realize how stupid I was. To boys considering trying dip, don't. It's fun, but you will smell bad, your teeth will look gross and most of your girlfriends will break up with you. I'm done. I just wish I never started. And to all the Poly teachers trying to snipe kids in the locker room, tough luck ;)": [0.0, 17.200000762939453], "When Michael Jordan says \"Go Blue\" \nThe Wolverine community welcomes you with open arms🙏🏻〽️\nhttp://m.bleacherreport.com/articles/2547320-michigan-wolverines-become-1st-jordan-brand-program-in-college-football": [0.4000000059604645, 0.4000000059604645], "Homies": [0.0, 0.0], "*Andrew and Guillem are getting ready for a photograph when they suddenly realize that there is a live beehive wrapped around a woman's head.* 🐝": [0.0, 0.0], "Never knew Dwayne the Rock won an NCAA Championship at The U. Just when I thought he couldn't be more savage. They called him \"Dewey\" and he sang country music. My dude.": [0.0, 0.699999988079071], "*Homeless man (HM) earnestly asks for food in front of Midtown restaurant*\nMe: *Takes out container of warm rolls from dinner* here you go, sir. Have a blessed night.\nHM: What is this? Why the fuck you give me bread?\nMe: *surprised, but hopeful* I promise you, it's really good bread. Please take it:\nHM: Take this shit back, I can't believe you just gave me fuckin bread.\nMe: *disappointed, giving up* Wow. That's pretty ungrateful of you, but okay. \nHM: Damn, give me some steak or somethin!\n\nWhat a savage.": [0.0, 4.900000095367432], "Announcing that I'm taking a gap year to pursue the Wii Bowling Olympics to represent my country. Sorry, UMich!": [0.10000000149011612, 0.30000001192092896], "Jay, I decided to pull out a throwback because we both know how far we've come. Whether it was my uncomfortable smile and early-onset \"dad bod\" or your excessive yvng shrimp-ness (and Ethan just killing the game as always), we have been through everything. Yankees-Mets birthday parties, trips to Point Pleasant and Six Flags, Michigan Basketball Camps, slap cams (couldn't forget that one😭), the cyph, the scheme, and 2 am 911 calls. I could keep going, but I'm not tryna get too nostalgic. All I know is you are my best friend, my brother, a shrimp and my soon-to-be cousin (SO Jodie and Luis🎉!!), and I'll always be there for you. Your little ass barely made it to 18, but I foresee a long and incredible life ahead of you. So many great memories yet to be made, man. Much love.": [0.4000000059604645, 4.699999809265137], "http://m.mlb.com/cutfour/2015/07/07/135351770/johnny-cueto-does-short-wiggle-to-freeze-nats-batter?partnerId=as_mlb_20150708_48826536&adbid=973204356044537&adbpl=fb&adbpr=196554717042842": [0.0, 0.0], "Approved to throw. The comeback begins ⚾️🙏": [0.30000001192092896, 0.6000000238418579], "http://bleacherreport.com/articles/2514637-nationals-bryce-harper-hits-home-run-using-america-themed-bat-on-july-4th?utm_source=facebook.com&utm_medium=referral&utm_campaign=programming-national\n\nSavagery": [0.0, 0.10000000149011612], "Happy 19th, you tank. Whether you're dressing in Gene's signature Hawaiian shirts, or eating cheesy bread with Molly after the cyph, you manage to do it impressively and in such typical Grossi fashion. We have some great memories from the past four years, and will continue making them this summer and into college. Dallas needs some Grossi, and they're gonna get it. Love you, bro.": [0.6000000238418579, 3.299999952316284], "Happy Father's Day to the greatest dude out there. You inspire me to be a better person every day. From long road trips in Georgia for our various baseball trips to blasting country in the hot tub after practice, you have been a supportive dad and my best friend. Thanks for all that you do, and I have a lot to learn from you. And yes, you have a couple more years of kicking my ass... Until I catch up to you😜": [0.5, 3.299999952316284], "Iggy does not deserve MVP. Shooting 25 percent from the free throw line is not a good look.Shoulda went to Curry or Green. That's also saying that Iggy was more valuable to the finals than LeBron. Smh": [-0.699999988079071, 2.9000000953674316], "Sis": [0.0, 0.0], "Steph is too good.": [0.6000000238418579, 0.6000000238418579], "Happy 22nd anniversary to the most fun, smart, sensitive, passionate couple I know. 28 years ago, my dad started chatting up the new waitress at his favorite bar in Ann Arbor. They went on a date the next night. That waitress was my mother. After 28 years, you two could not be more in love, and that is the most amazing thing. For 22 years of marriage, you guys have been the best team in the league, and Ethan and I could not appreciate it more. I hope that the person I share my life with can be as great a partner as you guys are to each other. So as you venture on to your midlife crises together, I have certainty that you will overcome any obstacle set before you as a team. I am so glad that we got to share the anniversary eve together at the Rolling Stones concert, as their music represents the beauty, energy and charisma of your marriage. I love you both so much, and hopefully Michigan brings me the same fortune as it did you.": [0.4000000059604645, 5.099999904632568], "Dirty dippers": [-0.699999988079071, 0.699999988079071], "When there are no interracial high fives. Some update. #thanksapple": [0.0, 0.30000001192092896], "https://m.youtube.com/watch?v=GdKcyxmXzBw\n#gocavs": [0.0, 0.0], "If anyone needs two tickets for gov ball on Friday, hmu!": [0.30000001192092896, 0.30000001192092896], "Caption this": [0.10000000149011612, 0.10000000149011612], "Shout out to my man Los whose about to become a dad 🙏. Love you, brotha.": [0.800000011920929, 1.7000000476837158], "#NotMyDate": [0.0, 0.0], "Lunch with the Cali fam": [0.699999988079071, 0.699999988079071], "http://m.mlb.com/cutfour/2015/05/20/125679162/bartolo-colon-hit-tracker-the-quest-for-three-hits?partnerId=as_mlb_20150525_46415086&adbid=950556054976034&adbpl=fb&adbpr=196554717042842\n\nBig Bart the legend \nAndrew Grossi": [0.0, 0.10000000149011612], "EDC": [0.0, 0.0], "Poly Fam": [0.30000001192092896, 0.30000001192092896], "http://m.mlb.com/cutfour/2015/05/17/124897346/college-player-catches-hbp?adbid=946311225400517&adbpl=fb&adbpr=196554717042842&partnerId=as_mlb_20150517_45940316&short_code=30afw": [0.0, 0.0], "In honor of mommy month": [0.0, 0.0], "The riots in Baltimore are understandable, but not justified. A black community in Baltimore that was once falsely perceived as violent is just proving everyone right, and ruining it for all of the outstanding people of color in the United States. Not to mention that the rioters are destroying their own community, what is that going to do? 400 years of social and legal oppression is beyond frustrating, but responding with violence can only aggravate the wound. I could never share the anger of the black population, but this is just common sense. I want equal opportunity to happen, but the riots in Baltimore only puts Black America in a deeper hole. Nobody knows the exact right way to fix racial inequality in America, but it is certainly not burning down the city you were raised in.": [-0.30000001192092896, 2.299999952316284], "\"Life would be cruel if there was no humor\"": [-0.20000000298023224, 0.20000000298023224], "Accepted to the University of Michigan Honors Program! South Quad here we come〽️": [0.0, 0.10000000149011612], "When you hit a bump in the road there are two things you can do: \n1. Cry about it. Do everything you can to avoid it. Let go.\n2. Get up. Be a leader to your peers and show them that you can handle a little pain. Don't show them that you are broken even if you are. Today is the best day of your life and tomorrow will be even better. You control everything you can control because life is just to short to let the things you love pass you by. \n\nNothing changes. Even though my blood isn't really flowing in one arm, my heart is still beating so I might as well use it.": [0.10000000149011612, 4.199999809265137], "Shout out to my little brother for throwing a complete game shutout in 78 pitches in his Poly debut. If that's not the future then I don't know what is.": [0.30000001192092896, 0.6000000238418579], "Get me home to lil bruh": [0.699999988079071, 0.699999988079071], "http://www.mtv.com/news/2131149/vin-diesel-paul-walker-tribute/\nlegend": [0.30000001192092896, 0.30000001192092896], "5": [0.10000000149011612, 0.10000000149011612], "And there goes half of our country's brackets...\n#ThanksObama": [0.0, 0.30000001192092896], "I rock the DVB shirts for the ladies": [0.10000000149011612, 0.10000000149011612], "Friends, \nPlease fight for the LGBT community in sports!\nGo to http://www.athleteally.org/action/fairness-final-four/ and sign a petition to fight against discrimination.\nThe Governor of Indiana has signed a law that makes it legal to discriminate against the LGBT community in the Hoosier state, a place that's home to the NCAA and to major sporting events every year.Did you know that Indiana is the host state to the Final Four, the NFL Combine, the USA P&G Gymnastics Championship, the USA Olympic Diving Trials, the Big Ten Football Championship and more?\nNow, athletes, coaches, and fans that attend these events, including the 80,000 fans arriving next week for the Final Four, can be turned away and disrespected because of who they are. \nThat's why we've launched the #Final4Fairness Campaign with the help of Lambda Legal. We must bring this injustice to the forefront of the Final Four. The time is NOW.\nSports are a part of Indiana's fabric, but the values we hold true in athletics are compromised on Hoosier soil.\nJoin the #Final4Fairness Campaign and help us tell Indiana and every other state that discrimination is unacceptable on the court and under the law.": [-0.30000001192092896, 4.699999809265137], "A Pitcher-Only and a disabled child bring the energy to the dugout #benchcaptains #tylerleonwincig": [-0.5, 0.5], "Me and my boy Ed are ready to represent Poly at Nicolas Mulitz's own prestigious IMG Academy\nEddie Faicco": [0.4000000059604645, 0.4000000059604645], "Congratulations to my boy Phil-Ay Mignon on getting into Kenyon. You can change that name back now, Ohio.": [0.0, 0.10000000149011612], "When you withdraw your application from a school months ago, and they send you a deferral anyway. #Mich>Rochester": [-0.20000000298023224, 0.5], "Too ready for Florida #striveforfive": [0.0, 0.0], "So not down to do my homework that I asked a magic 8 ball if I was going to do it, and it said very doubtful. So we're gonna go with that...": [-0.30000001192092896, 0.800000011920929], "Didn't think an entire subway car could smell like fish... I was wrong.": [-0.5, 1.100000023841858], "What a fine young man": [0.20000000298023224, 0.20000000298023224], "Everyone in Les Mis was incredible! Poly is so talented. Can't believe I wasn't a part of it, but it was still such a pleasure to see the magic from the other side of the stage. The cast, crew, Ms. Baehr, Steven, and everyone involved should be very proud.": [0.800000011920929, 3.200000047683716], "I guess the Icee Berg melts around baseball season lol": [0.30000001192092896, 0.30000001192092896], "I'm just rooting for the Patriots because Mr. Harman will definitely call that snow day.": [0.4000000059604645, 0.4000000059604645], "My life would be pretty damn perfect if I could sustain myself solely on Chipotle tortilla chips.": [0.699999988079071, 0.699999988079071], "http://www.businessinsider.com/tom-brady-diet-2015-1\n\nThe most basic of them all": [0.0, 0.10000000149011612], "Shout out to my little brother and his friend Xavier nailing Hugh Jackman with snowballs. \n": [0.8999999761581421, 0.8999999761581421], "Well it was good while it lasted": [0.30000001192092896, 0.30000001192092896], "https://www.youtube.com/watch?v=OTRmyXX6ipU\n\nSo weak.": [-0.30000001192092896, 0.800000011920929], "If you like the article below, you should all sign the pledge! If you are asking, what is this going to do to help? All I can say is that it has definitely made me more aware of the language that I use. I have had multiple people come up to me and say the same thing. By signing the pledge, you are subconsciously making a commitment to being more mindful about how you speak, and how you respond to anti-LGBT language for your friends and peers. No amount of money can solve this issue. All we can do is band together and be the best we can be. Poly and all high schools around the country should be following in Hudson's footsteps. He shows us that anyone can be above societal influence, regardless of sexual orientation. Here is the link, it takes 2 seconds, and it can teach you for the rest of your life to be mindful. Not a bad trade...\n\n": [0.10000000149011612, 4.699999809265137], "http://www.brooklyneagle.com/articles/2015/1/19/poly-prep-hosts-founder-nonprofit-promoting-acceptance-athletes-all-sexual": [0.0, 0.0], "Me and my sis. Love you Dyl. Thanks for convincing me to come to NFTY.": [0.5, 1.600000023841858], "Welcome Mr. Harbaugh. You made the right choice! And what good timing!": [0.5, 1.5], "University of Michigan Class of 2019! Go Blue!": [0.0, 0.10000000149011612], "Just some kids with a dream #BMCC19": [0.800000011920929, 0.800000011920929], "RIP Gamblero. I have had the pleasure of holding season tickets in your section for the past 3 years, and you were always the life of the party. You brought incredible energy to the arena every night, and were always there supporting the boys through thick and thin. You embody a great fan. Even when we were getting obliterated, you managed to make it fun. This video represents the kind of energy you brought to games. Section 23 will never be as lit. There will not be a game that I attend that my family does not think of your passion and intensity. You are Brooklyn.": [0.30000001192092896, 4.5], "SO to Mariota. Finally!!!": [0.30000001192092896, 0.6000000238418579], "http://www.eonline.com/news/603234/dj-earworm-s-2014-united-states-of-pop-is-an-awesome-mashup-of-taylor-swift-iggy-azalea-ariana-grande-more-listen-now?cmpid=sn-111021-facebook-na-eonline\n\nThis is nicee.": [0.5, 1.0], "4 hours later, still got the itis.": [0.10000000149011612, 0.10000000149011612], "Throwback": [0.10000000149011612, 0.10000000149011612], "Tbt": [0.0, 0.0], "I'm not international politics expert, but what the hell is wrong with us?\nIt would be one thing if the responses were well-balanced, but there was a clear and inexplicable bias. \n\n": [-0.6000000238418579, 1.2999999523162842], "Love you guys. Awesome weekend. #EERNY+TOASTY": [0.6000000238418579, 1.899999976158142], "Happy birthday Kohn lmao": [0.699999988079071, 0.699999988079071], "Livingstone pulled out the hashtag game this time :o": [0.0, 0.0], "I see a lot of people usin #squaa now. It's a movement.\nShmurda affects culture.": [0.10000000149011612, 0.4000000059604645], "Shoutout to Luke Bryan": [0.0, 0.0], "Greatest crew out there. Rednecks of New York. #TylerWincig": [0.30000001192092896, 1.0], "Bumgardener is a flat out stud.": [0.0, 0.0], "New challenge? Armin Hammered Patrick DeMarco": [0.10000000149011612, 0.30000001192092896], "Lol hbd bro": [0.30000001192092896, 0.30000001192092896], "Not tryna walk into these Ebola infested outdoors. Harman just cancel school already.": [-0.30000001192092896, 0.699999988079071], "Senior Leaders 2015": [0.10000000149011612, 0.10000000149011612], "Happy birthday to the little bro/prodigy. I can't believe I'm leaving this year and won't get to see your dumb ass smile every day. Let's win this fifth and make history (again). Tin man is on the rise, just watch.": [0.10000000149011612, 1.399999976158142], "Denard Robinson is a legend. 〽️": [0.10000000149011612, 0.30000001192092896], "http://elitedaily.com/dating/jewish-girls-make-best-wives/697684/\n\nMichigan is the right school for making these dreams come true. Idolize my sonsss!": [0.0, 0.20000000298023224], "Mr. Gray killin it with the photography as always. When I blew the perfect game in my final inning. Still won 10-0 though so who cares. #polybaseball2014": [0.30000001192092896, 1.399999976158142], "swiggity swag is on my mind": [0.20000000298023224, 0.20000000298023224], "A Squared * 2 + E... Get it?": [0.0, 0.10000000149011612], "Throwback to this gem Adam Agler": [0.10000000149011612, 0.10000000149011612], "See the difference #GoBlue": [0.10000000149011612, 0.10000000149011612], "Armon LOVES nip slips.": [0.8999999761581421, 0.8999999761581421], "When will it stop?": [-0.10000000149011612, 0.10000000149011612], "My newsfeed looks like a history book. Chill": [0.10000000149011612, 1.0], "A Pitcher-Only since birth right heree. Only a true PO could make such a move. Right on Wilhelmsen, makin us proud. ": [0.10000000149011612, 1.2999999523162842], "Michigan football is making me a worse person. When Notre Dame, Utah and Minnesota all beat u by ten points or more, you know a lot of things are wrong. I don't watch football, I watch second string airheads who play lefty quarterback throw the ball to the opposing team.": [-0.5, 1.600000023841858], "To a hilarious, intelligent and overall good kid. I didn't spend very much time with you throughout high school, but our occasional conversations were always memorable in some way. I was always impressed by your alacrity to speak out in History class, and I respected it a lot because I am the same way. We didn't have any classes together this year, but it's crazy to think that Monday we were actually catching up in commons because we haven't really spoken this year. I enjoyed watching you on the soccer field and heard great things about your contributions to the hockey program, and you will be greatly missed by so many. You see all these wall posts up in heaven? This is because so many people fuckin care so much about you, man. So much love around you. I know that you are in a better place now, because you deserve it kid.": [0.4000000059604645, 5.199999809265137], "Jeter <3": [0.699999988079071, 0.699999988079071], "1,000 freedom towers wouldn't even begin to replace the two that fell that day. NYC and the world as a whole has never been the same, and never will be. Some things are just impossible to move on from, and nothing can change that. I am so fortunate that my family was not affected, but it's hard to see friends relive this day for the past 13 years. Words are inadequate to describe the pain the world feels, especially native New Yorkers. Always remember.": [0.0, 2.700000047683716], "This is beyond embarrassing": [-0.8999999761581421, 0.8999999761581421], "Devin Funchess is straight up nasty!!! #GoBlue\n#DevinToDevin": [-0.4000000059604645, 1.0], "Shout out to Chicago for an incredible run.": [0.8999999761581421, 0.8999999761581421], "The Browns making their typically poor team management choices. #FreeMoneyManziel": [-0.20000000298023224, 0.699999988079071], "Headley is my boyyy": [0.0, 0.0], "NEW GIRL ACTUALLY ISNT ON TILL SEPTEMBER I SHOULDA KNOWN I WAS SO HYPE TOO I WORE MY DRIVING MOCCASINS AND EVERYTHING! #BUTSCHMITTYISSTILLALIVE": [-0.4000000059604645, 1.0], "Bossss": [0.0, 0.0], "http://www.perfectgame.org/Articles/View.aspx?article=10305\n\nShoutout to the bro makin' front page. \n": [0.10000000149011612, 0.20000000298023224], "Me and Rog representing well on 7/4. 🇺🇸 \nGreat times on the road this summer, dad.": [0.699999988079071, 1.399999976158142], "I had a Cavs hat before it was cool. Just saying...": [0.0, 0.8999999761581421], "Loll I wish ": [0.30000001192092896, 0.30000001192092896], "A suitable place to be honoring our country. By celebrating one our country's great liberators and heroes. A true embodiment of the American Dream and all the our free country stands for: Martin Luther King Jr.": [0.5, 1.7000000476837158], "7/4 baby.": [0.10000000149011612, 0.10000000149011612], "Shrek is love. Shrek is life.": [0.699999988079071, 1.5], "#ConceptualIsLife": [0.0, 0.0], "Boys take Saratoga": [0.0, 0.0], "Four peat!!! Champss! Love you fuckers! #WeDidItForTheSeniors #TimeFor5": [0.20000000298023224, 0.8999999761581421], "Nets, you have to be joking...": [-0.4000000059604645, 0.4000000059604645], "http://my.chicagotribune.com/#section/-1/article/p2p-80172718/ \nFuck your apology.\nYou will never get money or respect from the league and hopefully anyone again you Confederate piece of shit.": [-0.800000011920929, 1.7000000476837158], "Sunny and 75 ☀️": [0.10000000149011612, 0.10000000149011612], "Livingston violated.": [-0.8999999761581421, 0.8999999761581421], "Winning games tho. All-American to my right. #RoadToTheShip #polybaseball2014": [0.30000001192092896, 0.8999999761581421], "Deez Nets be playin with my emotions!": [0.699999988079071, 0.699999988079071], "Stoopin to Sterlings level. The black NBA community should handle this by raising awareness not by isolating themselves from those who doubt them. This is just upsetting, Larry I thought you were low. As a white guy, I'm not sure I understand how much Sterling's comments hurt, but it doesn't mean anybody should be running away. ": [-0.10000000149011612, 1.399999976158142], "These refs are literally morons. Really could be 3-1 without their help to the raptors. How many charge calls are they gonna screw up???": [-0.30000001192092896, 1.7999999523162842], "To all of those who knew him, Jerry the guinea pig sadly passed away earlier today at age 6. Jerry, although I never was the one who fed you, played with you or, in fact, paid any attention to you at all, I felt that we had a very strong bond. I already feel the void that is left between mine and my brother's room, and it is inescapable (except for the fact that we could probably get a nice TV there or something). We never really connected on a personal level, but you were a nice little thing sadly overshadowed by Chip the dog, but you held your own. So Jerry, thanks for being a member of the Ehrenberg household for 6 years, and I hope you find peace in heaven and see your buddy Tom again.": [0.0, 2.0], "http://www.buzzfeed.com/ryanhatesthis/please-dont-be-like-this-kid-and-dump-someone-with-an-instag?bffb&s=mobile\n\nSuch a box for this hahahah": [0.20000000298023224, 0.4000000059604645], "Lmao the Nets got #taped. If only the Knicks only played the Nets every game this season, we know who would make the playoffs, but unfortunately, Knick-fans, that is not how it works. So tape us all you want for the remainder of the season, but your schedule ends in a few days.": [-0.10000000149011612, 0.6000000238418579], "Bubba's the man.": [0.0, 0.0], "Stretching your arm on any possible surface throughout the day. #ShitPitchersDo": [0.0, 0.10000000149011612], "Just when it seems like everything is going for you, there is always something that screws it up. #SlippyIsNotHappy": [0.0, 0.10000000149011612], "Proud to be a part of the GVLL family!": [0.8999999761581421, 0.8999999761581421], "http://www.youtube.com/watch?v=AURnnpiGOxs\nHe barely jumps. This is ridiculous.": [-0.5, 1.0], "It was too dope I had to. Lets goooo! #polybaseball2014": [0.30000001192092896, 0.8999999761581421], "Shoot me in the face.": [0.5, 0.5], "http://www.msgvarsity.com/brooklyn-bronx/nyc-preseason-baseball-no-1-poly-prep-1.1588745\n\nPreseason number one! Lets prove that we deserve it! #RoadToTheShip #PolyBaseball2014": [0.20000000298023224, 1.100000023841858], "This NCAA tournament is literally too lit.": [0.10000000149011612, 0.10000000149011612], "Godammit Providence": [0.0, 0.0], "Squad upppp #acl #HUAHH": [0.20000000298023224, 0.20000000298023224], "http://www.upworthy.com/watch-a-powerful-twist-happen-as-this-girl-grows-up-a-second-per-day?g=2&c=ufb1\n\nGave me chills. What's wrong with this world smh.": [0.0, 1.399999976158142], "Why doesn't LeBron just do that every night like he says he can?... smh. I think he may have caught KD though.": [-0.20000000298023224, 0.800000011920929], "hittin da ill nae nae": [0.10000000149011612, 0.10000000149011612], "The Thunder need to trade Westbrook. They need a stronger center to be in he front court with Ibaka, not a point guard taking shots away from the best scorer of this era.": [0.0, 0.699999988079071], "Cuse finally didn't get away with their repetitive lucky bullshit. You shoot 32 from the field, you deserve to fail. Damn and it actually took this long that's the saddest part.": [-0.6000000238418579, 2.0], "One tenth of a second?!?!?! Trey Burke type clutch on the break boyyyy": [0.0, 0.20000000298023224], "THANK YOU GOD IS WATCHING OVER ME": [0.0, 0.0], "Mason Plumlee tho": [0.0, 0.0], "Am I nice now?": [0.4000000059604645, 0.4000000059604645], "Lmao this is hilarious.\nhttps://facebook.com/lookback/ #FacebookIs10": [0.4000000059604645, 0.8999999761581421], "The new anthem \nhttp://www.youtube.com/watch?v=1whMAIGNq7E #ConceptualPhysicsIsLife": [0.10000000149011612, 0.10000000149011612], "Snow Gods. Let's go.": [0.10000000149011612, 0.20000000298023224], "Super Bowl 2014 hannn #TheDayOnes": [0.0, 0.0], "Man fuck flappy bird. I deleted it after 30 seconds. I can't deal with that much frustration.": [-0.6000000238418579, 1.7999999523162842], "http://espn.go.com/blog/collegebasketballnation/post/_/id/93279/brennans-wooden-watch-week-11?ex_cid=espnapi_public Jayson Michael Camacho I told you to watch out for the big homie Nik Stauskas! He's up to number 5 and takin over!": [0.0, 0.30000001192092896], "Macklewhore.": [0.10000000149011612, 0.10000000149011612], "Why watch the Grammy's when you can sit by your desk reading your friends' reactions?": [-0.30000001192092896, 0.30000001192092896], "Gotta memorize 40 lines of this poem today... fml. #NoGreaterStruggleThanTheReinzi": [0.10000000149011612, 0.4000000059604645], "Go Blue! Y'all woulda tonight we were overrated": [-0.20000000298023224, 0.800000011920929], "I love how Tanaka got seven years and I haven't even seen him throw. Great that we got him, but that's a classic Yankees contract... Smh.": [0.10000000149011612, 2.0], "Look who I found! #heartless": [-0.20000000298023224, 1.0], "Night out with the old man.": [0.0, 0.0], "http://www.perfectgame.org/players/playerprofile.aspx?ID=232586\n\nSuch an animal.": [0.10000000149011612, 0.20000000298023224], "Damn you Tre Mason, damn you...": [-0.5, 0.5], "Um, hi FSU, what the hell are you doing?": [-0.6000000238418579, 0.6000000238418579], "Insidious 2 was a bold choice at 3am.": [0.20000000298023224, 0.20000000298023224], "Bama got scraped. #AJMcCaronsgirlfriendmightbreakupwithhimnowbecauseheisntrealanymoreandisgettingfat": [0.10000000149011612, 0.20000000298023224], "The double-A battery takes the sea. Wish I had more lol. #bahamamama #alwaysturnt": [0.0, 0.5], "Happy New Year everyone from the Eberg men! Second semester junior year: Make it or break it. Can't drop the ball lets go! ⚾️ and school is what I need. Thanks to all my friends and fam for love and support, you are who I count on. To all the fake people out there, get real, society hasn't given up on you. My resolution is to be focused and 100% honest. If I want something imma ask for it, no games played, the only time games are okay is on the field. To all these other juniors out here, this is our time to show what we are willing to give for great opportunities in our future. Let's fuck shit up. My other resolution is to wear this cowboy hat, every man has to have 1 cowboy hat and 1 bucket hat. If you don't like cowboy hats, you have a lot of resolutions to make. Happy 2014!": [0.20000000298023224, 6.599999904632568], "My homie Jason feeling some typa way.": [0.0, 0.0], "Gettin off to signature start in San Antonio. #jasonkiddtakeoffyoursuityoubelongonthecourtnotinthehuddle": [0.10000000149011612, 0.30000001192092896], "MY SON TREY BURKE": [0.10000000149011612, 0.10000000149011612], "LaMarcus Aldridge for MVP. Jacob Kohn no way I'm trading him to u lol. srry": [0.0, 0.10000000149011612], "PEOPLE NEED TO STOP PUTTING BORN SINNER OVER YEEZUS! Luca Milstein agrees": [-0.20000000298023224, 1.100000023841858], "Lol, deactivating again.": [0.0, 0.0], "Being a Michigan fan is like chewing bad bubble gum: it's sweet for the first twenty minutes and then it is faced with it's depressingly shitty reality.": [-0.8999999761581421, 0.8999999761581421], "Deactivating this shit till after SATs. Peace FB!": [-0.30000001192092896, 0.6000000238418579], "Lol I was bored": [0.20000000298023224, 0.20000000298023224], "Lmaoo how is Michigan still ranked?": [0.0, 0.0], "Michigan sports makes me want to pull my eyes out. I really can't watch them destroy themselves much longer. Very dramatic, but #facts.": [-0.10000000149011612, 1.0], "http://news.msn.com/crime-justice/girlfriend-claims-zimmerman-pointed-gun-at-her#tscptmf\nThis guy.": [0.0, 0.0], "Brendan Gibbons is THE clutchest rn. How do u get a kick of with 4 seconds left with the clock running? We need a TD though...": [0.0, 0.6000000238418579], "Oh.": [0.0, 0.0], "LIU Brooklyn is nice. they shoulda beat Indiana Merritt Miller u guys are gonna be wack this year! haha": [0.20000000298023224, 1.0], "Out to Michigan Basketball's first game on Friday. Not gonna lose the championship this year. Freshmen Zak Irvin and Derrick Walton lookin right this year. They're definitely gonna help. #FinalFourBound": [0.10000000149011612, 0.8999999761581421], "The Ehrenberg Fam at its finest <3": [0.8999999761581421, 0.8999999761581421], "Florida State: BCS Champs. You know it's gonna happen.": [0.0, 0.10000000149011612], "Mike McAloon Jameis Winston for prez. ": [0.0, 0.0], "Why can't the Nets just hold a nice lead? Smfh.": [-0.5, 1.100000023841858], "Post some pics, that was easily the best thing ever. I didn't take any Ryan Maeglin Galen Cadley": [0.4000000059604645, 0.8999999761581421], "Michael Carter Williams: Next AI? Jayson": [0.0, 0.0], "Jack Rothstein Ethan Ehrenberg This scene lmaooo": [0.0, 0.0], "Futuree": [0.0, 0.0], "It's a sus photo buts it's w.e. Happy birthday Dyl, ur the bro and one of the funniest dudes I know. Rooming with u in Florida was mad fun, and playing ball with u has been too from chillin on the vars bench last year 😂😉 to terrorizing Greg. Ur a good friend and it's fun hangin with u. Continue to work hard on that ⚾️ dream and I know there's been setbacks but keep grindin and get that dead lift up. Keep going hard, and get those Slimmies with Prato ;))). Keep goin hard have a killer night.": [0.5, 3.5999999046325684], "Lol I love Michigan football. Right when our quarterback remembers how to throw a football our defense forgets how to play the sport of football... Go figure.": [0.4000000059604645, 1.2999999523162842], "\"Found this in the archives\" #grossi #tbt #sexyflow #sex": [0.0, 0.0], "Brady (C)Hoke? C'mon son.": [0.0, 0.0], "Luca Milstein gave me the inspiration with his cover, but just wanted to point out when Heisenberg broke bad. RIP WW.": [0.10000000149011612, 0.8999999761581421], "Thank you, Drew Brees. You always seem to be my Fantasy Football savior somehow...": [0.4000000059604645, 0.8999999761581421], "Not gonna spoil anyone's night, but that was the best ending it could've been. For those who missed the finale, you are in for it, damnnn. #BreakingBad": [0.4000000059604645, 1.399999976158142], "http://www.youtube.com/watch?v=DQ1Oz6K4rOI\nDamn, if there's still a Bob Marley out there, its this guy. Tyler DiBartolo I know you can appreciate this hahah.": [0.30000001192092896, 0.8999999761581421], "The amazing races. #laventuresssss": [0.4000000059604645, 0.8999999761581421], "That moment when everybody is posting about iOS 7 and my phone won't let me download it yet. Screw you, Apple.": [-0.20000000298023224, 0.5], "Walter White= Complete and utter badass. RIP to the DEA though... Luca Milstein I was convinced you were right, but Jesse didn't do what he should have.": [0.20000000298023224, 1.0], "Thank. God. That was the worst win I've ever seen.": [-0.30000001192092896, 0.8999999761581421], "What is going on? We smacked Notre Dame, I hope Brady Hoke is just making things exciting...": [0.20000000298023224, 0.699999988079071], "#freeheisenberg": [0.0, 0.0], "GO BLUE! Despite that finish, we still shoulda won by 21 at least...": [-0.10000000149011612, 0.6000000238418579], "Theo, despite how disappointing this is. You gotta keep your head up and keep going. I wanna thank you for being a really good friend over the past two years. Poly is an interesting place, and you kept me in check and you were the person I could fall back on and trust. Due to extenuating circumstances, you gotta go your separate way, but regardless of the fact that we still gonna chill, it will be hard not havin you around this year. Just keep pushing, learn from your mistakes, and don't make them again. We must move on. Theo Feldman": [0.0, 3.4000000953674316], "With my fave crew. Since day one.": [0.4000000059604645, 0.8999999761581421], "When Michigan's up by 50 😊. We ready ND!": [0.20000000298023224, 0.4000000059604645], "Some early morning ⚾ never hurts. @infoarbitrage photography ™ some form pitching and long toss. #nodaysoff": [0.0, 0.20000000298023224], "Nobody wants to see 10 of your group snap chats a day. I really could care less about your  mediocre car dances  and the dog rolling over. #facts": [-0.30000001192092896, 1.2000000476837158], "Ugh Can't wait for College Football season. Making Saturdays even better every single time, I need it more than ever during junior year lol. Devin Gardener and Michigan are about to shock the world! #beatohio #big10champs #killbraxtonmiller Ethan Ehrenberg Adam Agler Blaine Warmbein Max Schneider Roger Ehrenberg Carin Levine Ehrenberg": [0.10000000149011612, 1.100000023841858], "SORIANO!": [0.10000000149011612, 0.10000000149011612], "With the little cousin!": [0.4000000059604645, 0.4000000059604645], "Just having a football catch with the brothers when Mitch McGary, Spike Albrecht, Caris LeVert and Nik Stauskas join the action in the middle of town. Not to mention Mitch threw a 60 yard pea. Not your average day on the U of M campus... So fun.": [0.10000000149011612, 1.5], "I never want to see a Jack-In-The-Box to again... Never will I be the same.": [-0.10000000149011612, 0.20000000298023224], "The CESPÉD(ES) was just cut at city field! Congrats, and I believed in you from the beginning!": [0.10000000149011612, 0.20000000298023224], "#quinoa": [0.10000000149011612, 0.10000000149011612], "The world is so screwed up. Trayvon Martin doesn't deserve this; his death was not justified.": [-0.800000011920929, 1.7000000476837158], "Put the team on my back!": [0.0, 0.0], "Lol haven't even played a game yet Florida weather is shit, but still chillin with the bros at Buffalo Wild Wings! It's a good nite, we tryna win tmorrow!": [0.5, 1.0], "We out to Florida tomorrow, and then have #perfectgame for the next week. Some hot weather and baseball. Epitome of happiness :). #gothamsnation. Btw we need to get our shit together and show them a little somethin, because we were great last year, and we can't get used to being second best... Lets get it boys. I learned a lot this year during HS ball for #bluedevilsnation, and probably the best thing I got out of it was it is not how you start it's how you finish so lets do the same thing, because we have the talent, and we are building the chemistry, so lets win as one.": [0.30000001192092896, 2.0], "Bday 2morrow, killed it in showcase today! Likin life right now... I can smell 16 now.": [0.0, 0.699999988079071], "#jazznation": [0.0, 0.0], "Jayson, MCW is the starter for the 76ers! How crazy is that? Lol Burke went 9 tho hahah.": [0.10000000149011612, 0.4000000059604645], "Just went down mainstream and started Breaking Bad... I was a skeptic, but everyone is right, it's pretty dope. #othwithdrawal #jackedoutonmeth\nEli this show is the key to optimizing jacked-outedness! #wephenoms #exceptsometimes #quinoa": [0.0, 2.299999952316284], "http://cgi.ebay.com/ebaymotors/Bugatti-Veyron-16-4-2010-bugatti-veyron-grand-sport-white-over-blue-low-miles-san-diego-/300918944107?pt=US_Cars_Trucks&hash=item46102ab16b&vxp=mtr#ht_12918wt_1170\n\nMy latest pickup on Ebay! Check it out! #iwokeupinanewbugatti #iboughtitonebay\n\nBut actually though... Who sells their Bugatti on Ebay?": [0.20000000298023224, 1.2999999523162842], "https://www.facebook.com/photo.php?v=10151393440761294&set=vb.322921811293&type=2&theater\nThis is sick. Lets get to work... Starts off really basic, but it's insane by the end.": [0.0, 1.600000023841858], "Chris bosh makin up for it with his defense. Damn!": [0.10000000149011612, 0.4000000059604645], "I love watching the finals! OTs gonna be live!": [0.4000000059604645, 0.8999999761581421], "Ray Allen are u serious? U better hope thts a 3!": [0.0, 0.0], "I don't care who wins. Both teams are nice. I just wanna game 7!": [0.20000000298023224, 1.0], "Happy Father's Day to the best. You have helped me get through everything and you have exceeded the expectations set upon a father. You do not just show up, you are present, you live every moment and you are a great role model. I could not be happier. I may not always show it, but I am so thankful for who you are and would ask for nothing else. @infoarbitrage": [0.699999988079071, 4.300000190734863], "What it do D Lillard? Pissed I didn't get the trip-dub tho. Soo nice got the three like Steph Curry now plus the ankle breakers.": [-0.10000000149011612, 1.399999976158142], "School is officially over! Lets get itttt. 8)": [0.10000000149011612, 0.699999988079071], "Got an 89.4 in math this semester. Well how great is that luck? Fml": [0.10000000149011612, 0.8999999761581421], "http://www.youtube.com/watch?v=LAr6oAKieHk\nWatch this all the way through if you are a real basketball fan. This is living proof that nobody will ever be Michael Jordan. Disregard anything I have ever said in the past, because watching this was life changing. So worth the 15-minute study break. He is just too sick, nobody can ever make plays like he did again. LeBron is the closest there is to it, but c'mon, MJ has more than skill, he is an artist. Everything he does in basketball is just plain beautiful, and LeBron isn't remotely close. I would love to see a comeback out of this guy, because he is far and away the best athlete I have ever watched. It sucks that us 15-16 year old kids never got to see him play, because it is something else.": [0.10000000149011612, 5.099999904632568], "Oklahoma softball is too real.": [0.0, 0.0], "http://thefunnyplanet.com/pic/Men-Are-All-The-Same-15511\nSo true. lmao": [0.10000000149011612, 0.30000001192092896], "Had a good first season despite the ups and downs. Congrats to all the senior who have put in so much work to make Poly the great baseball program that it is. I have learned a lot from you guys and wish you all the best of luck in the future. Most of you guys have won three in a row, and that is just beyond impressive. I hope the rest of us who will be back at Poly next year will put in work and make that 3-peat a 4-peat. Lets go do it.": [0.5, 3.5], "Had a great time ballin with Chris Copeland and the crew. Really fun night and awesome opportunity. Credits to Roger Ehrenberg": [0.6000000238418579, 2.0], "My little brother just put in the Sesame Street theme song outta the blue... Just remembered how that shit was my childhood. I miss not having responsibilities. Lmao, now I have to go study for finals and SAT Chemistry (y). I'll take sesame street over chemical equilibrium any day.": [0.20000000298023224, 2.5], "You know something's wrong when Chicago shoots 25% from the field... The Heat defense is just filthy. Lmao Nate Robinson didn't even score...": [-0.6000000238418579, 1.7999999523162842], "Klay Thompsons going off! 29 pts 6 reb in the first half.": [0.0, 0.0], "Crew.": [0.0, 0.0], "So the Bulls just beat the Heat (dominated them)... So they still aren't the real deal, and it means absolutely nothing that the Nets went 7 games against them. NOT. The Bulls are so deep they will win with or without Deng and Rose. They proved that tonight. I'm not saying they'll win the series because they won't, but this is a wake up call to all you people who claim you know basketball.": [0.0, 1.2000000476837158], "About to hit a shot! Keep those hands back!": [0.10000000149011612, 0.20000000298023224], "So game seven, huh?": [0.0, 0.0], "\"I'm a Christian. I don't agree with homosexuality,\" Broussard said. \"I think it's a sin, as I think all sex outside of marriage between a man and a woman is.\n\n\"If you're openly living in unrepentant sin ... that's walking in open rebellion to God and to Jesus Christ,\" he added.\n\nhttp://www.latimes.com/entertainment/tv/showtracker/la-et-st-espn-chris-broussard-sparks-uproar-after-jason-collins-remarks-20130429,0,1157118.story\n\nMr. Broussard, I really respected you as a quality sports analyst, but now you can get fired and go to hell, the way you think a homosexual man should, but really, it is you who will. Seriously, these remarks were not yours to make, and not anyone else's to make either. Just lets Collins do what he wants to do, and what makes him happy, what he did was brave. People like Chris Broussard are the reason that we aren't making any progress as an accepting country and world. A respect, and well known sports figure yet again shows that our world is screwed up, and people that don't interpret the bible for what it is can just shove it. I think everyone's opinion should be valued, with exception this opinion, because it is just ridiculous. It does not concern anyone, it does not concern God and it most certainly does not concern Chris Broussard. God did not create a world so that there could be hatred; he created love, tolerance and acceptance, and how we choose to interpret things like this dictates our progress as global citizens and people. I may be guilty of throwing around the \"gay\" \"homo\" \"faggot\" when it is not ever necessary, and that was not how I was raised so I screwed up, but we need to get better, people, much better.": [-0.10000000149011612, 5.400000095367432], "Somethin litee! Game six we out!": [0.10000000149011612, 0.20000000298023224], "We can sense it! Bk for the dub! Game six here we come!": [0.20000000298023224, 0.6000000238418579], "Gerald Wallace! He can do some crazy shit sometimes. Damn.": [0.10000000149011612, 0.4000000059604645], "Brookl(opez)yn": [-0.30000001192092896, 0.30000001192092896], "My man Joe tryna take over this game!  #bk #nbaplayoffs #joejohnson": [0.0, 0.4000000059604645], "Nate Robinson is filthy.": [-0.699999988079071, 0.699999988079071], "Nate Robinsons too real. Joe Johnson did it again tho!!!": [0.0, 0.10000000149011612], "These refs are terrible. Bk shoulda won...": [-0.30000001192092896, 1.0], "Damn, Paul George with the trip-dub. SO to him! Merritt Miller you must be happy with that performance.": [0.30000001192092896, 1.100000023841858], "Tomorrow is Friday! So excited to chill with the bros, play some baseball and spend some time with the fam. School is such shit. I just did this so I could use the new Facebook feature soo... and I like this angel character, he's a stud.": [0.20000000298023224, 2.5], "I've never really liked Kobe, but it's painful to see a great player and organization take such a hit. #PrayforKobe": [-0.30000001192092896, 0.800000011920929], "We did it against Kansas. Why not do it again?": [-0.10000000149011612, 0.20000000298023224], "A poem I wrote a while back. Thought it was fitting after tonights events. No stupid criticism in the comments though, please. Go blue. We found our real mirage, or almost did. #onedayonegame\n\nMirage\n\nYou thought you found it.\nYou thought you found it again. \nAnd again.\nAnd again.\nA man always strives to find out what he's best at.\nWhat's best for him. \nHe's thinks he found it.\nNope.\nSlipped away.\nLost in the desert like before.\nTrying to find his true home.\nWhat that home means is distinct for every man.\nIn time, he will know.\nHe will find home\nOr at least, what he thinks is home.\nHome can be finding passion.\nHome can be reconnecting with friends you care about.\nHome can be love.\nBut just as you think you see it, you realize it isn't real.\nJust the deception of a desert mirage. \nYou rub your eyes, and keep walking.\nUntil you stumble upon another mirage.\nThis continues until the mirage you stumbled upon doesn't go away.\nLiving the dream, so to speak.": [0.10000000149011612, 8.300000190734863], "I BLEED BLUE.": [0.10000000149011612, 0.10000000149011612], "Blue with a solid half!": [0.0, 0.0], "No matter what, Wichita went off.": [-0.20000000298023224, 0.20000000298023224], "Wow Brook Lopez": [0.0, 0.0], "D Will is going in! Going 30-10 and assuming the Joe Johnson clutch role for the nite!": [0.0, 0.0], "Ugh we suck.": [-0.6000000238418579, 0.6000000238418579], "Jayson Michael Camacho, when are we doing the draft?": [0.0, 0.0], "Observe; this was Sam from iCarly. Damn, time did her some good. ": [0.10000000149011612, 0.20000000298023224], "Stauksas is the king. 5 threes in first 15 minutes damnn.": [0.0, 0.10000000149011612], "WE DID IT ELITE EIGHT BABY!!!! WOOOOO ALL YOU DOUBTERS CAN BLOW ME AHHHHHHHHHHHHHHHH Max Schneider you hype? Thomas Munster\nMax Kushner was the good luck charm, and I guess Ethan Ehrenberg was okay too... wohoo. Kansas get outta the way!": [0.20000000298023224, 1.7000000476837158], "Shit. Elijah Johnson is wet af.": [-0.4000000059604645, 0.800000011920929], "Clear Path Foul much?": [-0.699999988079071, 0.699999988079071], "Mitch McGary comes aliveeeeeeeeeeeeee": [0.10000000149011612, 0.10000000149011612], "Trey Burke you sexy animal.": [0.6000000238418579, 0.6000000238418579], "TREY BURKE! Still so nervous tho... Jayson Michael Camacho u watching this shit???": [0.0, 1.5], "Back in NY. Wish I never got on that plane in palm beach. This is just shit. Only thing that makes me happy is the reminder that baseball is starting 10 am tomorrow! Back on the mound.": [0.0, 2.0], "Florida 2013. Love the game. Pound the strike zone, don't waste anything, throw every pitch with full intention.": [0.0, 1.7999999523162842], "Reunited at last! @ethan123454321 #brosforlife": [0.0, 0.10000000149011612], "Hannnn": [0.0, 0.0], "Jayson Michael Camacho": [0.0, 0.0], "We live.": [0.10000000149011612, 0.10000000149011612], "http://www.youtube.com/watch?feature=player_embedded&v=Fh0AQw3WFkE#!\nWhoa.\nJayson Michael Camacho Jerel Blades Hussain Nasir Jonathan Porter Merritt Miller I know you all appreciate this dirtiness.": [0.10000000149011612, 0.4000000059604645], "Why?": [-0.10000000149011612, 0.10000000149011612], "Deron. Williams. 7-7 from 3 in first 7 minutes. Damn. Jerel Blades": [0.0, 0.20000000298023224], "Prediction: Our Yankees are gonna start off the season like 10-30. Jayson Michael Camacho, do you think we can pull anything together with the scrubsquad?": [0.0, 0.0], "Well that's relieving, now we go back home, where we have been undeafeated for 2.5 years. #beatindiana Merritt Miller": [0.30000001192092896, 0.699999988079071], "How hard has it become to win away? Jeez.": [-0.10000000149011612, 0.30000001192092896], "Will not forget this! You guys are awesome. Made so many new friends here. Loved getting to know those of you I didn't know as well before.": [0.5, 2.299999952316284], "I can't believe it. Gonzaga's #1. I know it was inevitable but still. Harmon Edward Pardoe Jayson Michael Camacho": [0.0, 0.0], "I love Michigan. Way to bounce back. Way to make me pull all my hair out wayyy too close. Undefeated at home still thoooo": [0.0, 0.8999999761581421], "Tyson and Curry both having insane nights tho.": [0.699999988079071, 0.699999988079071], "Postgame Anger/Destruction": [0.800000011920929, 0.800000011920929], "Michigan I swear to God.": [0.10000000149011612, 0.10000000149011612], "IU goes down! Harmon Edward Pardoe Jayson Michael Camacho let the discussion commence.": [-0.10000000149011612, 0.20000000298023224], "Damn shout out to Dwade for playing amazing lately. Last couple games he even is outshining LeBron, gotta keep his team in check so they aren't riding Bron too hard.": [0.30000001192092896, 0.800000011920929], "Brandon Jennings is dirty, I must say.": [-0.5, 0.5], "Knicks getting smacked! #knicksrape <3": [0.4000000059604645, 0.8999999761581421], "How many times will he do it?": [0.0, 0.0], "NBA officiating is a true embarrassment. And by the way. Joe FUCKING Johnson!!!": [-0.30000001192092896, 1.0], "Wow. That is a great dog. This Harlem Shake thing is getting a bit outta hand though lmao. ": [0.5, 1.600000023841858], "Thanks for the great statuses courtesy of Max Kushner": [0.8999999761581421, 0.8999999761581421], "dont worry im on the pill": [0.10000000149011612, 0.10000000149011612], "Guys i want the d": [0.10000000149011612, 0.10000000149011612], "Luis LoudMouth Camacho and Jodie Levinson were amazing tonight!!! You two are so great performing together... Keep it up, because you both are so passionate and talented and those qualities are ones to embody. Love you guys, I'm so happy you are in my life... happy valentines day! I'm also so fortunate that my parents are so happy, the things they said tonight were some of the many reasons that proved that.": [0.8999999761581421, 4.599999904632568], "Can't compare LeBron to MJ yet (big picture), but he sure is playing like him right now, even with a bit more of an athletic edge. He is putting up crazy numbers, while bringing home the W's as well, damn, cudos to him.": [0.10000000149011612, 0.20000000298023224], "1. Screw Rienzi.\n2. Michigan is playing like they never seen a basketball before.": [0.0, 0.10000000149011612], "What does everyone think? Does he still got it? Jayson Michael Camacho Hussain Nasir Jonathan Porter. You may have already seen this, but what do u think?": [0.0, 0.10000000149011612], "Going to visit my Grammy tomorrow. We are so fortunate the surgery went well. Burton Trattner, try not to give her too much grief, but it's amazing that you've been there for her! I have been blessed with such a great family.": [0.699999988079071, 3.0999999046325684], "I'd rather not be #1 in the country again. It's been taboo all season. Harmon Edward Pardoe knows... Dude I'm scared to be 1 again.": [0.0, 0.10000000149011612], "Gettin me some fried chicken with the fam and Jayson Michael Camacho for superbowl hannnn. Niners we outt.": [0.4000000059604645, 0.8999999761581421], "Pitt is keeping it darn close... What do you think Jayson Michael Camacho?": [0.0, 0.10000000149011612], "3 peat superstar mode 2k13 fantasy draft association. Too nice.": [0.30000001192092896, 0.6000000238418579], "Andrew finds it difficult to do his work with Eli around.": [0.0, 0.0], "Whoa.": [0.10000000149011612, 0.10000000149011612], "I'm gonna enjoy it while it lasts! Go blue!": [0.30000001192092896, 0.699999988079071], "This is awesome ": [0.800000011920929, 0.800000011920929], "Studio with the bros @tbfproductions  Greg and Jay.": [0.0, 0.0], "Gonna miss San Fran. Boutta live out here someday...\nI love my family.\nWe are infinite.": [0.30000001192092896, 1.2000000476837158], "Good win for Michigan! Way to bounce back from a tough loss! 17-1. not bad.": [0.10000000149011612, 1.5], "So hype for baseball season, it's been too long.": [-0.30000001192092896, 0.30000001192092896], "Oh yeah. Merms is feelin tight.": [0.10000000149011612, 0.20000000298023224], "This is a nightmare.": [-0.800000011920929, 0.800000011920929], "Colin Kaepernick is a complete monster.": [0.0, 0.0], "The thirst...": [0.5, 0.5], "Ha not tryna offend anyone *cough* mike *cough* but ND suckssss. Lmaoo": [-0.4000000059604645, 1.0], "Joe Johnson, you gotta be kidding me! How does he do it! So. Clutch.": [0.0, 0.30000001192092896], "Jaws!": [0.10000000149011612, 0.10000000149011612], "Universal hannn": [0.0, 0.0], "3rd Street Promenade.": [0.10000000149011612, 0.10000000149011612], "Go blue!!! Lets shock the world with a win today.": [0.30000001192092896, 0.6000000238418579], "New Years Eve. Time to make my resolutions. \n\nOld guy in the top left makes the photo.": [0.20000000298023224, 0.699999988079071], "Papa rog is classy af. #classy #swagisforboysclassisformen": [0.699999988079071, 1.399999976158142], "Happy #newyear !!\n@mikaylahopee": [0.4000000059604645, 0.800000011920929], "Father-son luv.": [0.800000011920929, 0.800000011920929], "Cruuuuuuuuz": [0.0, 0.0], "For once! A giants game that's fun to watch! Eli manning is manning up.": [0.30000001192092896, 1.0], "Rueben Randle. Love this guy.": [0.4000000059604645, 0.8999999761581421], "When ur listening to dubstep while running and feelin like u gotta bust ass every time there's a bass drop lmao": [0.10000000149011612, 0.10000000149011612], "#pearlharbor . Thanks WWII vets for persevering through a period of immense adversity. Amazing to learn so much more about the events that took place in December of 1941.": [0.5, 1.600000023841858], "Deuces Maui.": [0.0, 0.0], "Avery Johnson's gone... Hmm. Phil Jackson where you at?": [0.0, 0.10000000149011612], "Me on the horsie awh yeah.": [0.20000000298023224, 0.20000000298023224], "METH... Look what I found in Hawaii, this must be stopped we needs our meth!": [0.0, 0.4000000059604645], "Nice view": [0.800000011920929, 0.800000011920929], "With mom <3 Hawaii": [0.4000000059604645, 0.8999999761581421], "Hey everyone.  Please sign this petition. ": [0.10000000149011612, 0.20000000298023224], "That awesome feeling when you don't procrastinate for once! :)": [0.8999999761581421, 0.8999999761581421], "My condolences to those children and teachers who lost their lives in Newton Connecticut. There are some crazy people out there. This is another reason (including the recent James Holmes case, and Jared Loughner a bit before that) why the 2nd amendment is bullshit. I know taking it away would upset a lot of redneck hillbillies out there, but there can't be so many lethal weapons just floating around. Look at the UK, for example, who only lost a couple hundred people due to murder-per year, while our country lost tens of thousand of people... Guess what? UK doesn't let crazy people (or people who have crazy sons) bear arms, and the statistics show. This is not only a sad time, but it's a lesson for our country to learn from its mistakes.": [-0.10000000149011612, 1.399999976158142], "I swear to God if the Angels don't win the World Series with the squad they have then what is the meaning of life and baseball, which are in my mind close to synonymous. Once you have 2 MVPs (Pujols and Hamilton) and an MVP runner up AS A ROOKIE (Mike Trout) on the same team, all barely 30 years old (Trout being 22), how can you not? Not to mention along with their pitching staff, which includes Jered Weaver and CJ Wilson. The MLB is messed up, its hard to watch this shit anymore.": [-0.30000001192092896, 1.2000000476837158], "And one for Phil! What was he thinking? Pie eating king, that's one way to bulk up in the offseason ;)": [0.10000000149011612, 0.5], "Thats violation.  http://espn.go.com/espn/story/_/id/8738942/107-2-bloomington-south-girls-basketball-team-beats-arlington Jonathan Porter Jayson Michael Camacho": [-0.4000000059604645, 0.800000011920929], "Happy 12.12.12!": [0.699999988079071, 0.699999988079071], "Fuck you Jason Kidd. D Will had his chance at the last second... Oh well.": [0.0, 0.0], "Reggie Evans. Rebounding machine.": [0.0, 0.0], "Wish I was there, but BK is already wrecking shit lets goooo! Carlos N Aline Soto Roger Ehrenberg Ethan Ehrenberg": [-0.20000000298023224, 0.4000000059604645], "http://www.youtube.com/watch?v=cfLZIAgbE0I\nYo this is my lifeee. Eli Kimbell \nSarah Remig thanks for showing me this it made my day.": [0.20000000298023224, 0.4000000059604645], "Damn Saints sit down. I knew David Wilson was a star, nobody believed me... One fumble shouldn't define his career, performances like this should.": [0.20000000298023224, 0.8999999761581421], "Shoutout to those in the MS play at LREI! Y'all impressed me very much :).": [0.6000000238418579, 1.2000000476837158], "Just got caught on the camera in 4th quarter starting a dance riot leggooo. Down by 4 with 9.3 seconds left, lets do it": [0.0, 0.20000000298023224], "Gerald Wallace just hit 4 threes in 90 seconds. Fuckin beast!": [0.30000001192092896, 1.2000000476837158], "Just was looking for some old project I did, and happened to stumble upon my G-Mail chats from 6/7th grade. I just relived so many moments that I really was not looking forward to reliving -_____-. Oh good times... Winnifred Bonjean-Alpart and Jayson Michael Camacho waaay back this was mad cute. I'm such a tool for looking back at all this shit but idc, its just too funny.": [0.20000000298023224, 2.0], "Nolan Young this describes our relationship...": [0.4000000059604645, 0.4000000059604645], "If Rex Ryan starts Mark Sanchez one more game this year. Ryan will officially become Sanchez's bitch, and will be a slap in the face for McElroy.": [-0.10000000149011612, 0.30000001192092896], "What I learned about fantasy football is you should always just have the defense that is playing against the Jets!": [0.4000000059604645, 0.4000000059604645], "Roger Ehrenberg are you seeing this Wisconsin score? Up on Nebraska 42-10 at HALF!": [0.0, 0.0], "What has happened to Kentucky? Coach Cal needs to get his team together!": [0.0, 0.0], "Practice Sunday morning? Rob Sollazzo Rob Calabrese Andrew Zapata Tristan Lopez Matt Zapata Philip James?": [0.0, 0.0], "Oh Kris...": [0.0, 0.0], "Cole Fenton don't die on me... I know it was disturbing, but you will get over it ;) lmaoooooo, but really, its not even something to laugh about. Shit was messed upp.": [-0.30000001192092896, 2.299999952316284], "Andray Blatche, the zero hero, got BK 10 rebounds in the first quarter, damn!": [-0.699999988079071, 0.699999988079071], "This Michigan game was not as close as it seemed, we dominated. Big win for the Wolverines, proving themselves. 7-0!": [0.0, 0.4000000059604645], "GO BLUE!": [0.10000000149011612, 0.10000000149011612], "That's a wrap...": [0.20000000298023224, 0.20000000298023224], "Some intense shid...": [0.4000000059604645, 0.4000000059604645], "Tipoff!": [0.10000000149011612, 0.10000000149011612], "Duke Blue Devils Basketball is ranked 2 and Michigan Basketball is ranked three! Duke has proved themselves and we have kinda, but big test at NC State!": [0.0, 0.20000000298023224], "The Giants are a mystery. They go from being atrocious to being amazing and then back to horrible and now they are giving one of the hottest teams in the NFL a beatdown. Damnn.": [-0.10000000149011612, 0.699999988079071], "I also lik borat \nAnd kkate uptown\nShe makes me happy": [0.8999999761581421, 0.8999999761581421], "U know what my favorite movie is... \n\nBRUNO it's a heart pounding thriller and I recommend it to everone": [0.800000011920929, 1.600000023841858], "Good time at the Nets game today with the bros. Shaky at the beginning but Joe Johnson and DWill helped us pull away at the end. Funny seeing Kai Han, Ben Ball, Alessandro Russo, Griffin Walsh, Will Cembalest, Yehia Essam and then Phil Sheers. Funny how many Poly kids were at the game.": [0.4000000059604645, 1.899999976158142], "With the bros in the Barclays suite #classy #swag @jerelblades @lilblack97": [0.699999988079071, 0.699999988079071], "The last comment...": [-0.10000000149011612, 0.10000000149011612], "So... Basketball season... Still bleeding blue.": [0.0, 1.2999999523162842], "About to pee myself watching this game. So stressed. Michigan offense come back!": [0.10000000149011612, 0.30000001192092896], "Beat Ohio! Wolverines we outttt! Idc that we can't make the Rose Bowl this year, this game is much more than that.": [0.0, 0.20000000298023224], "Ay cp3 and the clippers go downnnn. Brook Lopez went in": [0.0, 0.10000000149011612], "Go BK!": [0.0, 0.0], "Good game for Michigan tournament champs! 5-0": [0.30000001192092896, 0.800000011920929], "Have a great Thanksgiving fb fam!": [0.8999999761581421, 0.8999999761581421], "I hate when people come at your neck and then are exasperated when they receive any form of retaliation in return. Don't give if u can't receive (nomo)": [-0.6000000238418579, 1.2999999523162842], "Lms for rate from me and Theo Feldman": [0.0, 0.0], "looks like Battery tunnel reopened to all today.  yay!\n\n\n": [0.30000001192092896, 0.6000000238418579], "#1 and #2 go down in the same night, thats unreal. That also means that two of Michigans three losses were to the top two teams (Notre Dame and Alabama).": [0.0, 0.0], "With my bro at the roadhouse! Good to be back.": [0.5, 1.0], "Boredd someone text me. #attentionwhore": [0.10000000149011612, 0.20000000298023224], "'merica": [0.0, 0.0], ",merica": [0.0, 0.0], "Of course they do!": [0.0, 0.0], "So seems like New York is no fluke this year... Lets cross our fingers and see how long the miracle lasts!": [0.10000000149011612, 0.20000000298023224], "Damn. Shout out to Duke! Coach Cal is feeling tight!!! Hussain Nasir Harmon Edward Pardoe": [0.10000000149011612, 0.800000011920929], "Monday schedule tomorrow?": [0.0, 0.0], "This illustrates what New York is all about! What I stumble upon when walking through the city... No big deal. #hurricanesandy": [0.10000000149011612, 0.5], "who do you have a crush on?\nwell obviously my beloved wifey Luca Milstein\nbut the actual person knows who they are... so why announce it?": [0.10000000149011612, 0.20000000298023224], "inbox dem questions\ncopying both ma sons Jayson Michael Camacho and Coby Levinson": [0.0, 0.0], "Out to the Nets game with the bro Max Kushner": [0.20000000298023224, 0.20000000298023224], "Did Bamanation just go down? What happened to them being able to beat the Jaguars?": [-0.20000000298023224, 0.4000000059604645], "Oh mittens. Obama-san can't stay mad at you :).": [0.0, 0.0], "http://www.google.com/imgres?imgurl=http://i.imgur.com/L3tZi.jpg&imgrefurl=http://karmadecay.com/r/pics/comments/10tbzb/i_present_2termz/&h=500&w=500&sz=19&tbnid=0jIoUsSk6l_VmM:&tbnh=93&tbnw=93&zoom=1&usg=__nWiw8e1aG5qYIYJG_UkUpqhuEiw=&docid=9o-xaJq2qel1uM&sa=X&ei=o-KZUO6PEo2rqAGdpICQCA&ved=0CFgQ9QEwBw&dur=548": [0.0, 0.0], "OBAMA 2012. I expected him to win, but he kinda smacked him. My dad just read a headline that said \"Tea Party gets teabagged.\" Just like Donald Trump, all those republicans got balls in their mouth right now! Looking forward to a happy legal gay marriage and legal abortion-filled 4 years! #Landslide #ThankGod": [0.10000000149011612, 1.2000000476837158], "31 to go!": [0.10000000149011612, 0.10000000149011612], "Obama the takes the leadddd!!!": [0.0, 0.0], "This election is really gonna come down to 3 swing states I think: Florida, Pennsylvania and Ohio. This is gonna be stressful. First of all, I'd like to acknowledge that I know my opinion doesn't mean shit because first of all, I can't vote, and second of all, New York's not even close. However, if it did, I fully support Obama not because I love him, because I don't think he did a great job in his first term, but unlike Mr. Romney, he is able to address the social issues *cough*Gay Marriage, Abortion, Separation between church and state*cough*. Yes, Obama increased the deficit, but he had to get us out of a war we should have never taken part in (Iraq), we are in the worst financial position since the depression and our right-wing congress gave him very little help so a lot of his ideas were shut down. I can't say too much about \"Obamacare\" because I am not too well informed on every detail, but I guess some people don't like it very much, but it's better than having Romney, who will lower taxes for the rich and raise taxes on the middle class, and that makes very little sense. Just because Romney is too selfish to give up a portion of his income despite the fact that he has enough money to wipe his ass with sheets of gold, his avid supporter Donald Trump can also resonate with that as he is so greedy, that he would probably would take up Stephen Colbert's 1 million dollar offer to dip his balls in Trump's mouth. I happen to like neither, but with Romney's social plan, and his general sense of morality, I don't see how anybody could vote for him, I mean, no offense intended to his supporters, but I personally think the fact that a really significant portion of our country supports him over Obama is really just a joke. Larry, I know you're gonna wanna comment on this and tell me how I am wrong so I'll give you the green light on that front ;).": [-0.30000001192092896, 4.099999904632568], "Doug Martin is probably the best RB in the NFL right now.": [0.4000000059604645, 0.4000000059604645], "TOUCHDOWN!!!  yea there was no evidence to overturn that call. I expected them to do it though 14-7!!!": [-0.10000000149011612, 0.5], "That guy who just hit Cruz should be fined and suspended, that was messed up.": [-0.6000000238418579, 0.6000000238418579], "Power back= wasting my time on facebook again! :)": [0.4000000059604645, 0.4000000059604645], "Shits crazy": [0.0, 0.0], "Is everyone ok???": [0.0, 0.0], "Now our 3 day weekend becomes a four-day weekend awhh yeaaaa": [0.6000000238418579, 0.6000000238418579], "Harman, be a man and close school tomorrow. Follow Bloomberg's lead!": [0.0, 0.0], "Sandy get at me.": [0.10000000149011612, 0.10000000149011612], "So relieved...": [0.800000011920929, 0.800000011920929], "please tell me it's coming back...": [-0.20000000298023224, 0.20000000298023224], "no words.": [0.10000000149011612, 0.10000000149011612], "SHIT I'm scared. This game ain't over": [-0.20000000298023224, 0.5], "Can we have the replacement refs back? Wait, I was about to write that until they said there was no foul on the play. I was about to say... lets stuff them on 4th!": [-0.10000000149011612, 0.800000011920929], "Now we all know what happens in a close game in the fourth quarter with Eli Manning at QB...": [0.0, 0.0], "Cruz, despite all you have done for this organization, you suck ass right now.": [-0.4000000059604645, 0.4000000059604645], "And there goes our lead...": [0.0, 0.0], "C'mon GMen dont let this game slip away!!!": [-0.5, 0.5], "Pitching in the championship game!": [0.10000000149011612, 0.10000000149011612], "JPP!!!!! Cowboys weren't expecting this...": [0.0, 0.10000000149011612], "We out. #champions #comeback": [0.20000000298023224, 0.4000000059604645], "We outt.": [0.20000000298023224, 0.20000000298023224], "Yess. School closed= no history essay tomorrow. Winning league championship and then finding out that my weekends been extended by a day and maybe even 2 . It's been a good day.": [0.30000001192092896, 2.299999952316284], "We ready to take the chip": [0.0, 0.0], "Thought I was gonna pitch tomorrow. Other team forfeited the game, not exactly the way I imagined my team getting into the finals, but we'll take it. Gothams we outt.": [-0.10000000149011612, 1.0], "Damn, just looked at this and was amazed at how we all look so young. These were the days... Time goes so fast. Che Cappadocia Ryan Maeglin Matthew Soldano Sage Dylan Cooper Jack Rothstein Cara Colasanti Eli Tamarkin Jerel Blades Jarrett Moore Jayson Michael Camacho": [0.30000001192092896, 1.2000000476837158], "Why are Romney's grandkids always there? Don't they have school? Or are they just homeschooled on their respective private jets while Sasha and Malia actually go to school. smh. Not really a political issue, but just sayin, and also, they are wearing designer suits, even the toddler.": [-0.30000001192092896, 1.7000000476837158], "Oh my god... what if.": [0.0, 0.0], "At least it's better than Sanchez!": [0.5, 0.5], "Hahahaha. JPP knows where its at. Cole Fenton http://notbillwalton.lockerdome.com/media/101676305": [0.10000000149011612, 0.30000001192092896], "I just got the text from Eli Kimbell that we are busting ass in the semis. Go Gothams, lets finish this game out and keep rolling! So happy I can be back for next week!": [0.4000000059604645, 1.399999976158142], "GAME OVER! So happy RG3 scored for my fantasy and even happier that the giants were still able to win! Bumass Santana Moss can't hold onto the ball and Cruz is amazing. BigBlue": [0.30000001192092896, 1.5], "Are. You. Kidding. Me.": [0.0, 0.30000001192092896], "Hoke n D Rob ready to take this game leggo": [0.0, 0.0], "Good luck to the best team, The Gothams. Wish I was there with u guys, but I can only hope that we can pull thru this weekend so we can get to the chip next week. Praying for the team.": [0.20000000298023224, 0.800000011920929], "Denard practicing at the church before the gm.": [0.0, 0.0], "Yankees stay strong... Let's get back up and bounce back next year. Although disappointing, this is a wakeup call for us as a dynasty. Let's pop back up and have another great seasons and revive our team.": [0.20000000298023224, 1.399999976158142], "Adam Agler Ethan Ehrenberg": [0.0, 0.0], "What did I just see? Michigan at 5th??? Indiana at 1? I love Michigan but what is the world coming to?": [0.0, 0.6000000238418579], "Scal is taking over! Yesss dreams are reality.": [0.30000001192092896, 1.0], "Oh wow lmao": [0.30000001192092896, 0.30000001192092896], "LMS for truthis": [0.10000000149011612, 0.10000000149011612], "Giants went ham. Where did that come from? We looked amazing.": [0.20000000298023224, 0.8999999761581421], "Wow... That's pretty clever lol.": [0.5, 1.0], "JETER NOOO": [-0.6000000238418579, 0.6000000238418579]}